Repository: openstack/api-site
Catalog: api-guide/locale/*.po
Languages: de, hi, it, ko_kr, pa_in, vi_vn

source: OpenStack API Guide
de: OpenStack API Handbuch
hi: ओपनस्टॅक एपिआइ मार्गदर्शक
it: Guida API OpenStack
ko_kr: OpenStack API 가이드
pa_in: ਓਪਨ-ਸਟੈਕ API ਕਿਤਾਬਚਾ
vi_vn: Hướng dẫn OpenStack API

source: API Guide
de: API Handbuch
hi: एपिआइ मार्गदर्शक
it: Guida API
ko_kr: API 가이드
pa_in: API ਕਿਤਾਬਚਾ
vi_vn: Hướng dẫn API

source: OpenStack Foundation
hi: ओपनस्टॅक फाऊंडेशन
ko_kr: OpenStack 재단
pa_in: ਓਪਨ-ਸਟੈਕ ਫਾਊਂਡੇਸ਼ਨ
vi_vn: Sáng lập Openstack

source: local
de: lokal
hi: स्थानिक
it: locale
ko_kr: 로컬
pa_in: ਸਥਾਨਕ
vi_vn: cục bộ

source: Copyright details are filled in by the template.
de: Copyright Informationen werden durch die Vorlage ausgefüllt.
it: I dettagli di copyright sono riempiti dal modello.
ko_kr: 저작권 상세 정보는 양식에 맞게 채워집니다.
pa_in: ਨਕਲ-ਹੱਕ ਵੇਰਵੇ ਟੈਂਪਲੇਟ ਦੁਆਰਾ ਭਰੇ ਜਾਂਦੇ ਹਨ।
vi_vn: Chi tiết về bản quyền được điền vào theo mẫu.

source: OpenStack is an open source cloud computing platform for public and private clouds. A series of interrelated projects deliver a cloud infrastructure solution. This guide is for developers who want to extend the OpenStack APIs or write applications that run on an OpenStack cloud. This guide introduces developers to OpenStack API concepts, common tasks, and ways of interacting with the APIs.
de: OpenStack ist eine Open Source Cloud Computing Platform für öffentliche und private Cloudumgebungen. Eine Reihe von zusammenhängenden Projekten liefert diese Cloud Infrastrukturlösung. Diese Anleitung wendet sich an Entwickler, die die OpenStack APIs erweitern wollen, oder Anwendungen schreiben, die in einer OpenStack Cloud laufen. Diese Anleitung ist eine Einführung für Entwickler in die OpenStack API Konzepte, übliche Aufgaben und Wege, um mit den APIs zu arbeiten.
it: OpenStack è una piattaforma di cloud computing open source per cloud pubblici e privati​​. Una serie di progetti correlati offre una soluzione di infrastruttura cloud. Questa guida è per gli sviluppatori che desiderano estendere le API OpenStack o scrivere applicazioni che girano su una nube OpenStack. Questa guida introduce agli sviluppatori di OpenStack concetti API e modi di interagire con le API.
ko_kr: OpenStack은 공공 및 사설 클라우드를 위한 오픈 소스 클라우드 컴퓨팅 플랫폼입니다. 서로 관계있는 프로젝트 시리즈들은 클라우드 인프라 솔루션을 제공합니다. 이 가이드는 OpenStack API를 확장하거나 OpenStack 클라우드에서 실행되는 어플리케이션을 작성하려는 개발자를 위한 것입니다. 이 가이드는 OpenStack API 컨셉, 일반적인 작업, API와 상호 작용하는 방법에 대해서 개발자에게 소개합니다.
vi_vn: OpenStack là một là một nền tảng điện toán đám mây mã nguồn mở dành cho public và private cloud. Một loạt các project có liên quan đến nhau để đưa ra một giải pháp cơ sở hạ tầng cloud. Bải hướng dẫn này dành cho người phát triển muốn mở rộng OpenStack API hoặc viết các ứng dụng chạy trên OpenStack cloud. Bản hướng dẫn này giới thiệu với người phát triển những khái niệm về OpenStack API, những nhiệm vụ thông thường cũng như những cách để tương tác với API.

source: First edition of this book.
de: Erste Auflage des Buchs.
hi: प्रथम आवृत्ती
it: Prima edizione di questo libro.
ko_kr: 초판 작성.
pa_in: ਇਸ ਕਿਤਾਬ ਦਾ ਪਹਿਲਾ ਪ੍ਰਕਾਸ਼ਨ
vi_vn: Phiên bản đầu tiên của cuốn sách này.

source: API limits
de: API Begrenzungen
hi: एपिआइ मर्यादा
it: Limiti API
ko_kr: API 제한
pa_in: API ਹੱਦਾਂ
vi_vn: Các giới hạn API

source: API concepts
de: API Konzepte
hi: एपिआइ संकल्पना
it: Concetti sulle API
ko_kr: API 컨셉
vi_vn: Các khái niệm về API

source: API overview
de: API Übersicht
hi: एपिआइ विहंगावलोकन
it: Panoramica sulle API
ko_kr: API 개요
pa_in: API ਝਲਕ
vi_vn: Tổng quan về API

source: Use the APIs
de: Benutzung der APIs
hi: एपिआइ वापरण्यासाठी
it: Usare le API
ko_kr: API 사용
pa_in: API-ਆਂ ਵਰਤੋ
vi_vn: Sử dụng các API

source: Provide tutorials, examples, interspersed with specific API concepts?
de: Biete Tutorien oder Beispiele im Zusammenhang mit besonderen API Konzepten?
hi: विशिष्ट एपिआइ संकल्पना वापरण्यासाठी शिकवण्या, उदाहरणे द्या ?
it: Fornire tutorial, esempi, intervallati da specifici concetti API?
ko_kr: 특정 API 컨셉에대한 제공한 튜토리얼, 예제에 변화를 주었습니까?
vi_vn: Cung cấp hướng dẫn, ví dụ, nắm được các khái niệm API cụ thể

source: translator-credits
de: Danksagungen an die Übersetzer
it: Crediti di traduzione
ko_kr: Sungjin Kang <ujuc@ujuc.kr>, 2012-2014. Jay Lee <hyangii@gmail.com>, 2014. Seong-ho Cho <darkcircle.0426@gmail.com>, 2014.
pa_in: ਅਮਨਦੀਪ ਸਿੰਘ ਸੈਣੀ <jimidar@gmail.com>, 2013

source: OpenStack
hi: ओपनस्टॅक
pa_in: ਓਪਨ-ਸਟੈਕ
