Repository: openstack/api-site
Catalog: api-quick-start/source/locale/*/LC_MESSAGES/api-quick-start.po
Languages: ja, tr_tr, zh_cn

source: To launch instances, you must choose a name, an image, and a flavor for your instance.
ja: インスタンスを起動する場合、インスタンスの名前、イメージ、フレーバーを選択する必要があります。
tr_tr: Örnekler başlatmak için, örneğiniz bir isim, bir imaj ve bir nitelik seçmelisiniz.
zh_cn: 启动虚拟机实例前，需要为其选择名称，镜像和云主机类型。

source: To launch the ``my_instance`` instance, run the ``openstack server create`` command with the image and flavor IDs and the server name:
ja: インスタンス ``my_instance`` を起動するには、イメージ ID、フレーバー ID、サーバー名を指定して ``openstack server create`` コマンドを実行します。
tr_tr: ``my_instance`` örneğini başlatmak için, ``openstack server create`` komutunu imaj ve nitelik kimliği ve sunucu ismi ile çalıştırın:
zh_cn: 创建一个实例，记录下你使用的镜像和云主机类型的ID。

source: To list available images, call the Compute API through the ``openstack`` client:
ja: 利用可能なイメージの一覧を表示するには、 ``openstack`` クライアント経由で Compute API を呼び出します。
tr_tr: Tüm imajları listelemek için ``openstack`` istemcisi üzerinden Hesaplama API'sini çağırın:
zh_cn: 通过“openstack”客户端列出可用的镜像，调用计算服务API。

source: To list flavors, run this command:
ja: フレーバーの一覧を表示するには、このコマンドを実行します。
tr_tr: Nitelikleri listelemek için bu komutu çalıştırın:
zh_cn: 运行如下命令以列出云主机类型：

source: To remove the ``openstack`` client, run this command:
ja: ``openstack`` クライアントを削除する場合、このコマンドを実行します。
tr_tr: ``openstack`` istemcisini kaldırmak için bu komutu çalıştırın:
zh_cn: 运行如下命令移除“openstack”客户端。

source: To update the ``openstack`` client, run this command:
ja: ``openstack`` クライアントを更新する場合、このコマンドを実行します。
tr_tr: ``openstack`` istemcisini güncellemek için bu komutu çalıştırın:
zh_cn: 运行如下命令更新“openstack”客户端。

source: Type
ja: 型
tr_tr: Tip
zh_cn: 类型

source: Use ``pip`` to install the OpenStack clients on a Mac OS X or Linux system. It is easy and ensures that you get the latest version of the client from the `Python Package Index <http://pypi.python.org/pypi>`__. Also, ``pip`` lets you update or remove a package.
ja: Mac OS X や Linux のシステムに OpenStack クライアントをインストールするには ``pip`` を使用します。`Python Package Index <http://pypi.python.org/pypi>`__ からクライアントの最新バージョンを簡単かつ確実に入手できます。また、``pip`` を使ってパッケージの更新や削除ができます。
tr_tr: OpenStack istemcilerini Mac OS X veya Linux bir sistemde kurmak için ``pip`` kullanın. Kolaydır ve `Python Paket Indeksi <http://pypi.python.org/pypi>`__ nden en son istemci sürümünü kurduğunuzdan emin olur. Ayrıca ``pip`` bir paketi güncellemenizi ve kaldırmanızı da sağlar.
zh_cn: 使用“pip”在Mac OS X系统或者Linux系统上安装OpenStack客户端，确保从“Python Package Index<http://pypi.python.org/pypi>”获取最新版本的客户端。你可以使用“pip”去更新或者移除一个包。

source: Use the OpenStack APIs to launch server instances, create images, assign metadata to instances and images, create storage containers and objects, and complete other actions in your OpenStack cloud.
ja: OpenStack API を使用すると、OpenStack クラウドにおいて、サーバーインスタンスの起動、イメージの作成、インスタンスやイメージへのメタデータの割り当て、ストレージコンテナーやオブジェクトコンテナーの作成、他の操作などを実行できます。
tr_tr: Sunucu örnekleri başlatmak, imajlar oluşturmak, örneklere ve imajlara üstveri atamak, depolama konteynerleri ve nesneleri oluşturmak ve OpenStack bulutunuzdaki diğer eylemleri tamamlamak için OpenStack API'lerini kullanın.
zh_cn: 使用OpenStack API来启动服务器实例，创建镜像、给实例和镜像分配元数据、创建存储容器和对象以及完成其他相关的动作

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`__ in the *OpenStack End User Guide*.
ja: SDK を使って、OpenStack クラウドでリソースの作成や管理を自動化する Python ツールを作成できます。この SDK は OpenStack API への Python バインディングの実装で、これを使うことで、直接 REST コールを発行するのではなく、Python オブジェクトに対する呼び出しで Python で自動化タスクを実行できます。すべての OpenStack コマンドラインツールは Python SDK を使用して実装されています。*OpenStack エンドユーザーガイド* の `OpenStack Python SDK <https://docs.openstack.org/ja/user-guide/sdk.html>`__ を参照してください。
tr_tr: OpenStack bulutunuzda kaynak yaratan ve yöneten Python otomasyon betik dosyalarını yazmak için bu SDK'yi kullanın. SDK, doğrudan Python çağrıları yapmak yerine, Python nesneleri üzerinde çağrılar yaparak Python'da otomasyon görevleri gerçekleştirmenize olanak tanıyan OpenStack API'sine Python bağları uygular. Tüm OpenStack komut satırı araçları Python SDK kullanılarak gerçekleştirilmiştir. *OpenStack Son Kullanıcı Kılavuzu* nda `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>` __ ya bakın.

source: When you send API requests, you include the token in the ``X-Auth-Token`` header. If you access multiple OpenStack services, you must get a token for each service. A token is valid for a limited time before it expires. A token can also become invalid for other reasons. For example, if the roles for a user change, existing tokens for that user are no longer valid.
ja: API リクエストの送信時、``X-Auth-Token`` ヘッダーにトークンを指定します。複数の OpenStack サービスにアクセスする場合、サービス毎にトークンを取得する必要があります。トークンは一定時間有効で、その後期限切れとなります。トークンは他の理由で失効することもあります。例えば、ユーザーのロールが変更された場合、そのユーザーの既存のトークンは無効になります。
tr_tr: API istekleri gönderirken, jetonunuzu ``X-Auth-Token`` başlığına dahil edin. Eğer birden fazla OpenStack servisine erişiyorsanız, her biri için bir jeton almanız gerekmektedir. Bir jeton zaman aşımına uğramadan önce belli bir süre için geçerlidir. Bir jeton ayrıca başka sebeplerle de geçersiz olabilir. Örneğin, bir kullanıcının rolü değişirse bu kullanıcı için için önceden varolan jetonlar geçerli olmayacaktır.
zh_cn: 当你发送API请求时，你需要将令牌信息包含在“X-Auth-Token”的消息头中。如果你要访问多个OpenStack服务时，你必须为每个服务获取一个令牌。令牌只在一个有限的时间内是有效的。令牌也可能因为其他原因变成无效。例如，如果用户的角色发生了变化，该用户当前存在的令牌也就变成无效的。

source: Where *PROJECT* is the project name.
ja: *PROJECT* はプロジェクト名です。
tr_tr: *PROJE* proje ismidir.
zh_cn: “PROJECT”是一个工程名。

source: With the `TryStack <http://www.trystack.org/>`__ OpenStack installation, these services work together in the background of the installation, and many of these examples work on TryStack.
ja: `TryStack <http://www.trystack.org/>`__ OpenStack 環境を使用すると、これらのサービスが環境の中で一緒に動作しています。これらの例は、ほとんど TryStack で動作します。
tr_tr: `TryStack <http://www.trystack.org/>`__ OpenStack kurulumu ile bu servisler kurulumun arkaplanında birlikte çalışır ve bu örneklerin bir çoğu TryStack üzerinde çalışır.

source: You must install the client for each project separately, but the ``python-openstackclient`` covers multiple projects.
ja: 各プロジェクトのクライアントは別々にインストールする必要がありますが、 ``python-openstackclient`` は複数のプロジェクトに対応しています。
tr_tr: Her proje için istemciyi ayrı olarak kurmalısınız ancak ``python-openstackclient`` birden fazla projeyi kapsar.
zh_cn: 你必须为每个工程单独安装客户端，但是“python-openstackclient”可以覆盖多个工程。

source: `Application Catalog API v1 <https://developer.openstack.org/api-ref/application-catalog/v1/>`__
ja: `アプリケーションカタログAPI v1 <https://developer.openstack.org/api-ref/application-catalog/v1/>`__
tr_tr: `Uygulama Kataloğu API v1 <https://developer.openstack.org/api-ref/application-catalog/v1/>`__

source: `Backup API v1 <https://developer.openstack.org/api-ref/backup/v1/>`__
tr_tr: `Yedekleme API v1 <https://developer.openstack.org/api-ref/backup/v1/>`__

source: `Bare Metal API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (microversions)
ja: `Bare Metal API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (マイクロバージョン)
tr_tr: `Bare Metal API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (mikrosürümler)

source: `Block Storage API v2 <https://developer.openstack.org/api-ref/block-storage/v2/>`__
tr_tr: `Blok Depolama API v2 <https://developer.openstack.org/api-ref/block-storage/v2/>`__

source: `Block Storage API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__ (microversions)
ja: `Block Storage API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__ (マイクロバージョン)
tr_tr: `Blok Depolama API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__ (mikrosürümler)

source: `Clustering API v1 <https://developer.openstack.org/api-ref/clustering/>`__
tr_tr: `Kümeleme API v1 <https://developer.openstack.org/api-ref/clustering/>`__

source: `Compute API <https://developer.openstack.org/api-ref/compute/>`__ (microversions)
ja: `Compute API <https://developer.openstack.org/api-ref/compute/>`__ (マイクロバージョン)
tr_tr: `Hesaplama API <https://developer.openstack.org/api-ref/compute/>`__ (microversions)

source: `Container Infrastructure Management API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__ (microversions)
ja: `Container Infrastructure Management API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__ (マイクロバージョン)
tr_tr: `Konteyner Altyapı Yönetimi API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__ (mikrosürümler)

source: `Data Processing v1.1 <https://developer.openstack.org/api-ref/data-processing/>`__
tr_tr: `Veri İşleme v1.1 <https://developer.openstack.org/api-ref/data-processing/>`__

source: `Data Protection Orchestration v1 <https://developer.openstack.org/api-ref/data-protection-orchestration/>`__
tr_tr: `Veri Koruma Orkestrasyonu v1 <https://developer.openstack.org/api-ref/data-protection-orchestration/>`__

source: `Database Service API v1.0 <https://developer.openstack.org/api-ref/database/>`__
tr_tr: `Veritabanı Servisi API v1.0 <https://developer.openstack.org/api-ref/database/>`__

source: `Domain Name Server (DNS) API v2 <https://developer.openstack.org/api-ref/dns/>`__
tr_tr: `Alan Adı Sunucusu (DNS) API v2 <https://developer.openstack.org/api-ref/dns/>`__

source: `Identity API v2.0 <https://developer.openstack.org/api-ref/identity/v2>`__
tr_tr: `Kimlik API v2.0 <https://developer.openstack.org/api-ref/identity/v2>`__

source: `Identity API v3 <https://developer.openstack.org/api-ref/identity/v3>`__
tr_tr: `Kimlik API v3 <https://developer.openstack.org/api-ref/identity/v3>`__

source: `Identity API v3 extensions <https://developer.openstack.org/api-ref/identity/v3-ext>`__
tr_tr: `Kimlik API v3 uzantıları <https://developer.openstack.org/api-ref/identity/v3-ext>`__

source: `Identity admin API v2.0 <https://developer.openstack.org/api-ref/identity/v2-admin>`__
tr_tr: `Kimlik admin API v2.0 <https://developer.openstack.org/api-ref/identity/v2-admin>`__

source: `Image service API v1 <https://developer.openstack.org/api-ref/image/v1>`__
tr_tr: `Imaj servisi API v1 <https://developer.openstack.org/api-ref/image/v1>`__

source: `Image service API v2 <https://developer.openstack.org/api-ref/image/v2>`__
tr_tr: `Imaj servisi API v2 <https://developer.openstack.org/api-ref/image/v2>`__

source: `Load Balancer API v2 <https://developer.openstack.org/api-ref/load-balancer/v2>`__
tr_tr: `Yük Dengeleyici API v2 <https://developer.openstack.org/api-ref/load-balancer/v2>`__

source: `NFV Orchestration API v1.0 <https://developer.openstack.org/api-ref/nfv-orchestration/v1/>`__
tr_tr: `NFV Orkestrasyon API v1.0 <https://developer.openstack.org/api-ref/nfv-orchestration/v1/>`__

source: `Orchestration API v1 <https://developer.openstack.org/api-ref/orchestration/v1/>`__
tr_tr: `Orkestrasyon API v1 <https://developer.openstack.org/api-ref/orchestration/v1/>`__

source: `Search API v1 <https://developer.openstack.org/api-ref/search>`__
tr_tr: `Arama API v1 <https://developer.openstack.org/api-ref/search>`__

source: password (required)
ja: パスワード (必須)
tr_tr: Parola (gerekli)
zh_cn: password (必需)

source: string
ja: 文字列
tr_tr: Karakter dizisi

source: username (required)
ja: ユーザー名 (必須)
tr_tr: Kullanıcı adı (gerekli)
zh_cn: username (必需)

source: *tenantId* (Optional)
ja: *tenantId* (オプション)
zh_cn: *tenantId* (可选)

source: *tenantName* (Optional)
ja: *tenantName* (オプション)
zh_cn: *tenantName* (可选)

source: A token. If you do not provide a token, you must provide a user name and password.
ja: トークン。トークンを指定しない場合、ユーザー名とパスワードを指定する必要があります。
zh_cn: 令牌。假如您不提供令牌，则必须提供用户名和密码。

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the tenant where your cloud runs. Ask your cloud administrator for your user name, password, and tenant so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
ja: クレデンシャルは、一般的には、ユーザー名とパスワードの組み合わせです。オプションとして、あなたのクラウドを実行するテナントの名前や ID を指定します。認証トークンを生成するのに必要な、あなたのユーザー名、パスワード、テナントはクラウド管理者に問い合わせてください。ユーザー名とパスワードの代わりに、トークンを指定することもできます。
zh_cn: 证书通常是您的用户名和密码的组合，或者是您的云环境中租户的名称或ID。从管理员那里获得你的用户名，密码和租户等信息以便于生成认证令牌。此外，你可以使用这个令牌来代替用户名和密码。

source: Export the tenant name to the ``OS_PROJECT_NAME`` environment variable. For example:
ja: テナント名を環境変数 ``OS_PROJECT_NAME`` として export します。例:
zh_cn: 将租户的名字传递给环境变量“OS_PROJECT_NAME”，例如：

source: For complete information about the OpenStack clients, including how to source the ``openrc`` file, see `OpenStack End User Guide <http://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <http://docs.openstack.org/admin-guide/>`__, and `OpenStack Command-Line Interface Reference <http://docs.openstack.org/cli-reference/>`__.
zh_cn: 获取更多关于OpenStack客户端的信息，包括如何source “openrc”文件，请看“OpenStack End User Guide <http://docs.openstack.org/user-guide”，“OpenStack Administrator Guide <http://docs.openstack.org/admin-guide/>”和“OpenStack Command-Line Interface Reference <http://docs.openstack.org/cli-reference/>”。

source: For information about the command-line clients, see `OpenStack Command-Line Interface Reference <http://docs.openstack.org/cli-reference/>`__.
zh_cn: 获取更多关于命令行客户端的信息，请看OpenStack命令行接口参考文献： <http://docs.openstack.org/cli-reference/>

source: For information about the default ports that the OpenStack components use, see `Firewalls and default ports <http://docs.openstack.org/liberty/ config-reference/content/firewalls-default-ports.html>`_ in the *OpenStack Configuration Reference*.
zh_cn: 获取更多关于OpenStack组建使用的默认端口，查看OpenStack配置文档中的“Firewalls and default ports <http://docs.openstack.org/liberty/ config-reference/content/firewalls-default-ports.html>”。

source: If the request succeeds, it returns the ``OK (200)`` response code followed by a response body that contains a token in the form ``"id":"token"`` and an expiration date and time in the form ``"expires":"datetime"``.
ja: リクエストが成功すると、``OK (200)`` 応答が返されます。レスポンス本文には ``"id":"token"`` 形式のトークンと ``"expires":"datetime"`` 形式の有効期限が入っています。
zh_cn: 当请求成功时，将会返回响应码“OK(200)”，响应码跟随着响应体，响应体包含着一个以'' “id”: "token" ''这种形式的token，还有一个以'' "expires" :"datetime" '' 形式的有效时间。

source: If you do not know the tenant name or ID, send a request with "" for the tenant name or ID. The response returns the tenant name or ID.
ja: テナントの名前も ID も不明な場合、 テナント名か ID に "" を指定してリクエストを送信してください。レスポンスでテナント名かテナント ID が返されます。
zh_cn: 如果你不知道租户的名字或者ID，你可以发送“”获取租户名字或ID，响应将返回租户的名字或ID。

source: In a typical OpenStack deployment that runs Identity, you can specify your tenant name, and user name and password credentials to authenticate.
ja: Identity サービスを実行している一般的な OpenStack 環境の場合、認証するために、テナント名、ユーザー名、パスワードクレデンシャルを指定できます。
zh_cn: 在一个运行着认证服务的典型OpenStack环境中，你可以指定你的租户凭借用户名和密码进行身份验证。

source: The examples in this section use cURL commands. For information about cURL, see http://curl.haxx.se/. For information about the OpenStack APIs, see `OpenStack API Reference <http://developer.openstack.org/api-ref.html>`__.
zh_cn: 该部分的实例使用了cURL命令。关于cURL的信息，请参考http://curl.haxx.se/。关于OpenStack API的信息，请参考`OpenStack API Reference <http://developer.openstack.org/api-ref.html>`__。

source: The tenant ID. Both the *tenantId* and *tenantName* are optional and mutually exclusive. If you specify both attributes, the server returns the Bad Request (400) response code. If you do not know the tenant name or ID, send a request with "" for the tenant name or ID. The response returns the tenant name or ID.
ja: テナント ID。 *tenantId* と *tenantName* はどちらもオプションですが、両方同時には指定できません。両方の属性を指定した場合、サーバーは Bad Request (400) レスポンスコードを返します。テナントの名前も ID も不明な場合、 テナント名か ID に "" を指定してリクエストを送信してください。レスポンスでテナント名かテナント ID が返されます。
zh_cn: 租户ID，包括“tenantId”和“tenantName”都是可选且相互独立。如果这两个属性值被指定了，服务器将返回“Bad Request(400)”码。如果你不知道租户名称或者ID，你可以发送“”获取租户名称或ID，响应将返回租户的名称或ID。

source: The tenant name. Both the *tenantId* and *tenantName* are optional and mutually exclusive. If you specify both attributes, the server returns the Bad Request (400) response code.
ja: テナント名。 *tenantId* と *tenantName* はどちらもオプションですが、両方同時には指定できません。両方の属性を指定した場合、サーバーは Bad Request (400) レスポンスコードを返します。
zh_cn: 租户名称。*tenantId*和*tenantName*都是可选的，但不能被同时使用。如果这两个属性值都被指定了，服务将会返回Bad Request (400) 码。

source: The token expires every hour by default, though it can be configured differently - see the ``expiration`` option in the ``Description of token configuration options`` section of the `Identity Service Configuration <http://docs.openstack.org/mitaka/config-reference/identity/options.html#keystone-token>`__ page.
zh_cn: token的默认有效时间为1小时。可参考`Identity Service Configuration <http://docs.openstack.org/mitaka/config-reference/identity/options.html#keystone-token>`__ 中``Description of token configuration options`` 部分 ``expiration``相关进行配置。

source: This section shows how to make some basic Compute API calls. For a complete list of Compute API calls, see `Compute API <http://developer.openstack.org/api-ref/compute/>`__.
zh_cn: 这部分内容展示了如何调用一些基本的计算服务API，对于一个完整的计算API函数列表，请见<http://developer.openstack.org/api-ref/compute/>__

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See `OpenStack Python SDK <http://docs.openstack.org/user-guide/sdk.html>`__ in the *OpenStack End User Guide*.
zh_cn: 你可以使用SDK编写自动化Python脚本，用于创建和管理你的Openstack云环境中的资源。SDK实现了Python绑定OpenStack API，这能够让你使用Python实现自动化任务通过调用Python对象，而不用直接调用REST接口。所有的OpenStack命令行工具都可以使用Python SDK实现。获取更多关于“OpenStack Python SDK”的信息，可以参考“OpenStack And User Guide”：<http://docs.openstack.org/user-guide/sdk.html>

source: `Bare Metal API v1 <http://developer.openstack.org/api-ref/baremetal/>`__ (microversions)
zh_cn: 裸金属 API v1 <http://developer.openstack.org/api-ref/baremetal/>`__ (microversions)

source: `Block Storage API v1 <http://developer.openstack.org/api-ref/block-storage/v1/>`__
zh_cn: 块存储API v1 <http://developer.openstack.org/api-ref/block-storage/v1/>

source: `Block Storage API v2 <http://developer.openstack.org/api-ref/block-storage/v2/>`__
zh_cn: `块存储 API v2 <http://developer.openstack.org/api-ref/block-storage/v2/>`__

source: `Clustering API v1 <http://developer.openstack.org/api-ref/clustering/>`__
zh_cn: `集群API v1 <http://developer.openstack.org/api-ref/clustering/>`__

source: `Compute API <http://developer.openstack.org/api-ref/compute/>`__ (microversions)
zh_cn: `计算服务 API v1 <http://developer.openstack.org/api-ref/compute/>`__

source: `Data Processing v1.1 <http://developer.openstack.org/api-ref/data-processing/>`__
zh_cn: 数据处理V1.1 <http://developer.openstack.org/api-ref/data-processing/>`__

source: `Database Service API v1.0 <http://developer.openstack.org/api-ref/database/>`__
zh_cn: `数据库服务 API v1.0 <http://developer.openstack.org/api-ref/database/>`__

source: `Domain Name Server (DNS) API v2 <http://developer.openstack.org/api-ref/dns/>`__
zh_cn: `域名解析服务 (DNS) API v2 <http://developer.openstack.org/api-ref/dns/>`__

source: `Identity API v2.0 <http://developer.openstack.org/api-ref/identity/v2>`__
zh_cn: 身份认证API v2.0 <http://developer.openstack.org/api-ref/identity/v2>

source: `Identity API v2.0 extensions <http://developer.openstack.org/api-ref/identity/v2-ext>`__
zh_cn: 身份认证API v2.0 扩展 <http://developer.openstack.org/api-ref/identity/v2-ext>

source: `Identity API v3 <http://developer.openstack.org/api-ref/identity/v3>`__
zh_cn: `鉴别 API v3 <http://developer.openstack.org/api-ref/identity/v3>`__

source: `Identity API v3 extensions <http://developer.openstack.org/api-ref/identity/v3-ext>`__
zh_cn: `鉴别 API v3扩展 <http://developer.openstack.org/api-ref/identity/v3-ext>`__

source: `Identity admin API v2.0 <http://developer.openstack.org/api-ref/identity/v2-admin>`__
zh_cn: 身份认证管理员API v2.0 <http://developer.openstack.org/api-ref/identity/v2-admin>

source: `Image service API v1 <http://developer.openstack.org/api-ref/image/v1>`__
zh_cn: 镜像服务API v1 <http://developer.openstack.org/api-ref/image/v1>

source: `Image service API v2 <http://developer.openstack.org/api-ref/image/v2>`__
zh_cn: `镜像服务API v2 <http://developer.openstack.org/api-ref/image/v2>`__

source: `Networking API v2.0 <http://developer.openstack.org/api-ref/networking/v2>`__
zh_cn: `网络 API v2.0 <http://developer.openstack.org/api-ref/networking/v2>`__

source: `Object Storage API v1 <http://developer.openstack.org/api-ref/object-storage>`__
zh_cn: `对象存储 API v1 <http://developer.openstack.org/api-ref/object-storage>`__

source: `Orchestration API v1 <http://developer.openstack.org/api-ref/orchestration/v1/>`__
zh_cn: `服务编排API v1 <http://developer.openstack.org/api-ref/orchestration/v1/>`__

source: `Shared File Systems API v2 <http://developer.openstack.org/api-ref/shared-file-systems>`__ (microversions)
zh_cn: 共享文件系统API v2<http://developer.openstack.org/api-ref/shared-file-systems>（微版本）

source: token (Optional)
ja: token (オプション)
zh_cn: token (可选)

source: First, export your tenant name to the `OS_PROJECT_NAME` environment variable, your user name to the `OS_USERNAME` environment variable, and your password to the `OS_PASSWORD` environment variable. The example below uses a TryStack endpoint but you can also use `$OS_IDENTITYENDPOINT` as an environment variable as needed.
ja: まず、お使いのテナント名を `OS_PROJECT_NAME` 環境変数に、ユーザー名を `OS_USERNAME` 環境変数に、パスワードを `OS_PASSWORD` 環境変数に export します。以下の例は、TryStack エンドポイントを使用しますが、必要に応じて環境変数として `$OS_IDENTITYENDPOINT` を使用することもできます。

source: `Shared File Systems API v2 <https://developer.openstack.org/api-ref/shared-file-systems>`__ (microversions)
ja: `Shared File Systems API v2 <https://developer.openstack.org/api-ref/shared-file-systems>`__ (マイクロバージョン)
