Repository: openstack/api-site
Catalog: api-quick-start/source/locale/*/LC_MESSAGES/api-quick-start.po
Languages: ja, tr_tr, zh_cn

source: **OpenStack Python Software Development Kit (SDK)**
tr_tr: **OpenStack Python Yazılım Geliştirme Kiti (SDK)**
zh_cn: OpenStack Python软件开发工具包。

source: **OpenStack command-line client**
ja: **OpenStack コマンドラインクライアント**
tr_tr: **OpenStack komut satırı istemcisi**
zh_cn: OpenStack命令行客户端。

source: **REST clients**
ja: **REST クライアント**
tr_tr: **REST istemcileri**
zh_cn: REST客户端。

source: *Project Domain* (optional)
tr_tr: *Proje Alanı* (isteğe bağlı)

source: *Project ID* (optional)
tr_tr: *Proje Kimliği* (isteğe bağlı)

source: *Project Name* (optional)
tr_tr: *Proje Adı* (isteğe bağlı)

source: *User Domain* (required)
tr_tr: *Kullanıcı Alanı* (gerekli)

source: A command-line tool that lets you send HTTP requests and receive responses. See the section called :ref:`openstack_API_quick_guide`.
ja: HTTP リクエストを送信し、レスポンスを受信できるコマンドラインツール。:ref:`openstack_API_quick_guide` を参照してください。
tr_tr: HTTP istekleri göndermenizi ve cevapları almanızı sağlayan bir komut satırı aracı. :ref:`openstack_API_quick_guide` isimli bölüme bakın.
zh_cn: 命令行工具可以让你发送HTTP请求和接收响应。请参考“openstack_API_quick_guide”。

source: API quick-start examples
ja: API クイックスタートの例
tr_tr: API hızlı başlama örnekleri
zh_cn: API 快速入门示例

source: After you authenticate through Identity, you can use the other OpenStack APIs to create and manage resources in your OpenStack cloud. You can launch instances from images and assign metadata to instances through the Compute API or the **openstack** command-line client.
ja: Identity 経由で認証した後、他の OpenStack API を使用して、 OpenStack クラウドにリソースを作成したり管理したりできます。 Compute API や **openstack** コマンドラインクライアントを用いて、イメージからインスタンスを起動し、メタデータをインスタンスに割り当てることができます。
tr_tr: Kimlik ile kimlik doğruladıktan sonra OpenStack bulutunuzdaki kaynakları oluşturmak ve yönetmek için diğer OpenStack API'lerini kullanabilirsiniz. Hesaplama API'si veya **openstack** komut satırı istemcisini kullanarak imajlardan örnekler başlatabilir ve örneklere üstveri atayabilirsiniz.
zh_cn: 当你通过认证服务认证后，你可以使用其他的OpenStack APIs 来创建和管理你OpenStack云环境下的资源。你可以通过计算服务API或者“OpenStack”命令行客户端用镜像创建实例和为实例配置参数

source: Authenticate
ja: 認証
tr_tr: Kimlik doğrula
zh_cn: 认证

source: Authentication and API request workflow
ja: 認証と API リクエストのワークフロー
tr_tr: Kimlik doğrulama ve API istek iş akışı
zh_cn: 认证与 API 请求工作流

source: Before you can issue client commands, you must download and source the ``openrc`` file to set environment variables.
ja: クライアントコマンドを発行する前に、``openrc`` ファイルをダウンロードし、これを読み込んで、環境変数を設定する必要があります。
tr_tr: İstemi komutlarını çalıştırmadan önce ortam değişkenlerini ayarlamak için ``openrc`` dosyasını indirmeli ve kabuk uygulamanıza kaynak olarak göstermelisiniz.
zh_cn: 在执行客户端命令之前，你必须下载并source“openrc”文件来设置环境变量。

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__. For Chrome, see `rest-client <http://code.google.com/p/rest-client/>`__.
ja: Mozilla と Google は、ブラウザーベースの REST 用グラフィカルインターフェースを提供しています。Firefox については `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__ を、 Chrome については `rest-client <http://code.google.com/p/rest-client/>`__ を参照してください。
tr_tr: Mozilla ve Google REST için tarayıcı bazlı grafik arayüzler sağlamaktadır. Firefox için `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__ e bakın. Chrome için `rest-client <http://code.google.com/p/rest-client/>`__ a bakın.
zh_cn: Mozilla和Google都为REST提供了基于浏览器的图形接口。对于Firefox浏览器，请参看“RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>”，对于Chrome浏览器，请参看“rest-client <http://code.google.com/p/rest-client/>”。

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the project of your cloud. Ask your cloud administrator for your user name, password, and project so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
tr_tr: Kimlik bilgileri genellikle kullanıcı adınızın ve parolanızın birleşimidir ve isteğe bağlı olarak bulutunuzdaki projenin adı veya kimliğidir. Kimlik doğrulama jetonları oluşturabilmek için bulut yöneticinize kullanıcı adınızı, şifrenizi ve projenizi sorun. Alternatif olarak, bir kullanıcı adı ve parola yerine bir jeton sağlayabilirsiniz.

source: Current API versions
ja: カレント API バージョン
tr_tr: Mevcut API sürümleri
zh_cn: 当前API 版本

source: Current indicates a stable version that is up-to-date, recent, and might receive future versions. This endpoint should be prioritized over all others.
ja: 「カレント」は、最新の安定バージョンです。次のバージョンになる可能性があります。このエンドポイントは、他のすべてよりも優先されるべきです。
tr_tr: Mevcut; güncel, son ve gelecek versinleri alabilecek kararlı bir sürümü belirtir. Bu uç nokta diğerlerinin hepsinden daha öncelikli olmalıdır.

source: Deprecated API versions
ja: 非推奨 API バージョン
tr_tr: Eski API sürümleri
zh_cn: 不支持的API版本

source: Deprecated is a stable version that is still available but is being deprecated and might be removed in the future.
ja: 「非推奨」は、まだ利用できる安定バージョンですが、廃止されていきます。将来、削除される可能性があります。
tr_tr: Eskimiş, hala mevcut ancak artık eskimiş ve gelecekte kaldırılabilecek karalı sürümdür.
zh_cn: 不推荐的选项在稳定版本中仍然可用，但是不推荐使用，在将来可能会被删除。

source: Description
ja: 説明
tr_tr: Açıklama
zh_cn: 描述

source: Experimental is not a stable version. This version is under development or contains features that are otherwise subject to change. For more information about API status values and version information, see `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.
ja: 「実験」は安定していないバージョンです。このバージョンは開発中で、他の状態に変更を必要とする機能を含みます。API のステータス値とバージョンに関する詳細は `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__ を参照してください。
tr_tr: Deneysel, kararlı bir sürüm değildir. Bu sürüm henüz geliştirme aşamasındadır veya ileride değişikliğe uğrayabilir. API durum değerleri ve sürüm bilgisi hakkında daha fazla bilgi için `Sürüm Keşfi <https://wiki.openstack.org/wiki/VersionDiscovery>`__ sayfasına bakın.
zh_cn: 实验性质的版本不是稳定版本。这种版本还在开发中或者包含很有可能发生变化的特性。有关API状态和版本的更多信息，请参考版本揭秘 <https://wiki.openstack.org/wiki/VersionDiscovery>。

source: Export the $OS_PROJECT_ID from the token call, and then use the Compute API to list images:
ja: トークンのコールから $OS_PROJECT_ID を設定してから、Compute API を使用してイメージを一覧表示します。
tr_tr: Jeton çağrısından $OS_PROJECT_ID yi çıkar ve ardından resimleri listelemek için Hesaplama API'sini kullan:
zh_cn: 从令牌中导出$OS_PROJECT_ID，然后基于计算服务API来列出所有镜像

source: Export the $OS_PROJECT_ID from the token call, and then use the Compute API to list servers:
ja: トークンのコールから $OS_PROJECT_ID を設定してから、Compute API を使用してサーバーを一覧表示します。
tr_tr: Jeton çağrısından $OS_PROJECT_ID yi çıkar ve ardından sunucuları listelemek için Hesaplama API'sini kullan:
zh_cn: 从令牌中导出$OS_PROJECT_ID，然后基于计算服务API来列出所有服务器

source: Export the project name to the ``OS_PROJECT_NAME`` environment variable. For example:
tr_tr: Proje ismini ``OS_PROJECT_NAME`` ortam değişkenine atayın. Örneğin:

source: Export the token ID to the ``OS_TOKEN`` environment variable. For example:
ja: トークン ID を環境変数 ``OS_TOKEN`` として export します。例:
tr_tr: Jeton kimliğini ``OS_TOKEN`` ortam değişkenine atayın. Örneğin:
zh_cn: 将token ID传递给环境变量“OS_TOKEN”，例如：

source: First, export your project name to the ``OS_PROJECT_NAME`` environment variable, your project domain name to the ``OS_PROJECT_DOMAIN_NAME`` environment variable, your user name to the ``OS_USERNAME`` environment variable, your password to the ``OS_PASSWORD`` environment variable and your user domain name to the ``OS_USER_DOMAIN_NAME`` environment variable.
tr_tr: Önce, proje ismini ``OS_PROJECT_NAME`` ortam değişkenine, proje alan ismini ``OS_PROJECT_DOMAIN_NAME`` ortam değişkenine, kullanıcı adınızı ``OS_USERNAME`` ortam değişkenine, parolanızı ``OS_PASSWORD`` ortam değişkenine ve kullanıcı alan ismini ``OS_USER_DOMAIN_NAME`` ortam değişkenine atayın.

source: For complete information about the OpenStack clients, including how to source the ``openrc`` file, see `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, and `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
ja: ``openrc`` ファイルの読み込み方法など、OpenStack クライアントの詳細は、`OpenStack エンドユーザーガイド <https://docs.openstack.org/ja/user-guide/>`__ 、`OpenStack 管理者ガイド <https://docs.openstack.org/admin-guide/>`__ 、`OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__ を参照してください。
tr_tr: OpenStack istemcileri hakkında eksiksiz bilgi için, ``openrc`` dosyasının nasıl kaynak olarak gösterileceği dahil, `OpenStack Son Kullanıcı Rehberi <https://docs.openstack.org/user-guide/>`__, `OpenStack Yönetici Rehberi <https://docs.openstack.org/admin-guide/>`__ ve `OpenStack Komut Satırı Arayüz Referansı <https://docs.openstack.org/cli-reference/>`__ na bakın.

source: For example, install the ``openstack`` client:
ja: 例えば、 以下は ``openstack`` クライアントをインストールします。
tr_tr: Örneğin, ``openstack`` istemcisini kur:
zh_cn: 例如，安装“openstack”客户端：

source: For information about the command-line clients, see `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
ja: コマンドラインクライアントに関する情報は `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__ を参照してください。
tr_tr: Komut satırı istemcileri hakkında daha fazla bilgi için ÒpenStack Komut Satırı Arayüzü Referansı <https://docs.openstack.org/cli-reference/>`__ nı görün.

source: For information about the default ports that the OpenStack components use, see `Firewalls and default ports <https://docs.openstack.org/newton/config-reference/firewalls-default-ports.html>`_ in the *OpenStack Configuration Reference*.
ja: OpenStack のコンポーネントが使用するデフォルトのポート番号については、*OpenStack Configuration Reference* の `ファイアウォールとデフォルトのポート <hhttps://docs.openstack.org/newton/config-reference/firewalls-default-ports.html>`_ を参照してください。
tr_tr: OpenStack bileşenlerinin kullandığı varsayılan portlar ile ilgili daha fazla bilgi için *OpenStack Yapılandırma Referansı*ndaki `Güvenlik duvarları ve varsayılan portlar <https://docs.openstack.org/newton/config-reference/firewalls-default-ports.html>`_ sayfasına bakın.

source: For scripting work and simple requests, you can use a command-line client like the ``openstack-client`` client. This client enables you to use the Identity, Compute, Block Storage, and Object Storage APIs through a command-line interface. Also, each OpenStack project has a related client project that includes Python API bindings and a command-line interface (CLI).
ja: スクリプト作成や単純なリクエストには ``openstack-client`` クライアントなどのコマンドラインクライアントが利用できます。このクライアントを使って、コマンドラインインターフェースから Identity API、 Compute API、Block Storage API、Object Storage API を使用できます。また、各 OpenStack プロジェクトには対応するクライアントプロジェクトがあり、 Python API バインディングとコマンドラインインターフェース (CLI) が提供されています。
tr_tr: Betik işleri ve basit istekleri için ``openstack-client`` istemcisi gibi komut satırı istemcisini kullanabilirsiniz. Bu istemci bir komut satırı arayüzünden Kimlik, Hesaplama, Blok Depolama ve Nesne Depolama API'lerini kullanmanızı sağlar. Ayrıca her bir OpenStack projesi Python API bağlamaları ve bir komut satırı arayüzü (CLI) içeren ilgili bir istemci projesi bulundurur.
zh_cn: 对于脚本操作和简单的请求，你可以使用像“openstack-client”这样的客户端命令行，这个客户端能让你通过命令行借口去使用认证，计算，块存储，对象存储API。同时每个openstack项目都会提供包含Python API和命令行接口的客户端。

source: If the Unauthorized (401) error occurs, request another token.
ja: Unauthorized (401) エラーが発生した場合、別のトークンをリクエストします。
tr_tr: Unauthorized (401) hatası oluşursa başka bir jeton isteyin.
zh_cn: 如果Unauthorized (401)错误出现, 请再申请一个令牌。

source: If the request succeeds, it returns the ``Created (201)`` response code along with the token as a value in the ``X-Subject-Token`` response header. The header is followed by a response body that has an object of type ``token`` which has the token expiration date and time in the form ``"expires_at":"datetime"`` along with other attributes.
tr_tr: İstek başarılı olursa, ``Created (201)`` yanıt kodunu, jeton ile birlikte ``X-Subject-Token`` yanıt başlığında bir değer olarak döndürür. Başlığın ardından, diğer özelliklerle birliklikte ``"expires_at":"datetime"`` biçiminde jeton son kullanma tarih ve saatini içeren ``token`` tipinde bir yanıt gövdesi gelir.

source: In a typical OpenStack deployment that runs Identity, you can specify your project name, and user name and password credentials to authenticate.
tr_tr: Kimlik'i çalıştıran tipik bir OpenStack kurulumunda, kimlik doğrulamak için projenizin ismini ve kullanıcı adınızı ve parola bilginizi belirtebilirsiniz.

source: In the above request, the query string ``nocatalog`` is used as you just want to get a token and do not want the service catalog (if it is available for the user) cluttering the output. If a user wants to get the service catalog, this query string need not be appended to the URL.
tr_tr: Yukarıdaki istekte, sorgu karakter dizisi ``nocatalog`` sadece jeton almak isteğiniz ve çıktıyı dolduracak şekinde servis kataloğunu istemediğiniz için kullanıldı. Eğer bir kullanıcı servis kataloğunu almak isterse, bu sorgu karakter dizisi URL'e eklenmiş olmamalıdır.

source: Install or update a client package:
ja: パッケージのインストールまたは更新を行います。
tr_tr: Bir istemci paketi kur veya güncelle:
zh_cn: 安装或者更新一个客户端：

source: Install the clients
ja: クライアントのインストール
tr_tr: İstemcileri kur
zh_cn: 安装客户端

source: Launch an instance
ja: インスタンスの起動
tr_tr: Sunucu Başlat
zh_cn: 启动一个实例

source: Microversions indicates that the API follows a `pattern established by the Compute service <https://developer.openstack.org/api-guide/compute/microversions.html>`__ to enable small, documented changes to the API on a resource-by-resource basis.
ja: マイクロバージョンは、 `pattern established by the Compute service <https://developer.openstack.org/api-guide/compute/microversions.html>`__ にしたがっている API を意味します。リソースごとの単位で API に対して、小さな、ドキュメント化された変更を可能にします。
tr_tr: Mikroservisler API'nin API üzerinde kaynak-kaynak bazında, ufak ve belgelendirilmiş, `Hesaplama servisi tarafından belirtilen bir desen <https://developer.openstack.org/api-guide/compute/microversions.html>`__ izlediğini belirtir.

source: OpenStack API Documentation
ja: OpenStack API ドキュメント
tr_tr: OpenStack API Belgelendirmesi
zh_cn: OpenStack API文档

source: OpenStack APIs
ja: OpenStack API
tr_tr: OpenStack API'leri
zh_cn: OpenStack API

source: OpenStack command-line clients
ja: OpenStack コマンドラインクライアント
tr_tr: OpenStack komut satırı istemcileri
zh_cn: OpenStack 命令行客户端

source: Parameter
ja: パラメーター
tr_tr: Parametre
zh_cn: 参数

source: Request an authentication token from the Identity endpoint that your cloud administrator gave you. Send a payload of credentials in the request as shown in :ref:`authenticate`. If the request succeeds, the server returns an authentication token.
ja: クラウド管理者が指定した Identity エンドポイントに対して認証トークンを要求します。リクエストでクレデンシャルのペイロードを送信します。詳細は :ref:`authenticate` に書かれているとおりです。リクエストに成功すると、サーバーから認証トークンが返されます。
tr_tr: Bulut yöneticinizin size verdiği Kimlik ön ucundan bir kimlik doğrulama jetonu isteyin. :ref:`authenticate` de gösterildiği şekilde isteği kimlik bilgileri ile yüklü olarak gönderin. Eğer istek başarılı olursa, sunucu bir kimlik doğrulama jetonu döner.
zh_cn: 从云管理员提供的认证服务接入点请求一个认证令牌，以“ref:authenticate”的形式发送一个有效载荷的请求，如果请求成功，服务器将返回一个认证令牌。

source: Send API requests
ja: API リクエストの送信
tr_tr: API istekleri gönder
zh_cn: 发送 API 请求

source: Send API requests and include the token in the ``X-Auth-Token`` header. Continue to send API requests with that token until the service completes the request or the Unauthorized (401) error occurs.
ja: API リクエストを送信する際には ``X-Auth-Token`` ヘッダーにトークンを指定します。サービスに対するリクエストが全部完了するか、 Unauthorized (401) エラーが発生するまで、API リクエストの送信ではそのトークンを使い続けます。
tr_tr: API istekleri gönderin ve jetonu ``X-Auth-Token`` başlığına dahil edin. API isteklerini sunucu isteği tamamlayana veya Unauthorized (401) hatası oluşana kadar bu jetonla yapmaya devam edin.
zh_cn: 发送API请求，将令牌信息置于“X-Auth-Token”的消息头中，一直使用该令牌发送请求，直到请求的服务完成或者Unauthorized （401）错误出现。

source: Supported API versions
ja: サポート API バージョン
tr_tr: Desteklenen API sürümleri
zh_cn: 支持的API版本

source: Supported is a stable version that is available on the server. However, it is not likely the most recent available and might not be updated or might be deprecated at some time in the future.
ja: 「サポート」は、サーバーにおいて利用可能な安定バージョンです。しかしながら、利用可能な最新版ではなく、更新されないかもしれません。将来、非推奨になる可能性があります。
tr_tr: Desteklenen, sunucudaki mevcut kararlı bir sürümdür. Ancak mevcut en son sürüm değildir ve günellenmeyebilir veya gelecekte bir noktada artık kullanılmaz olabilir.
zh_cn: 支持的是在服务器上可用的稳定版本。它不会在最近不可用，并且被更新或者在将来某一时刻不被推荐使用。

source: The API status reflects the state of the endpoint on the service.
ja: API のステータスは、サービスにおけるエンドポイントの状態を反映します。
tr_tr: API durumu servisteki uç noktanın durumunu yansıtır.
zh_cn: API的状态反应了服务端点的状态。

source: The Block Storage API v3 is functionally identical to the Block Storage API v2. Subsequent API v3 microversions, such as v3.1, differ from API v2.
ja: Block Storage API v3 は、Block Storage API v2 と同じ機能を提供します。将来の API v3 マイクロバージョン、v3.1 などは、API v2 と異なります。
tr_tr: Blok Depolama API v3, Blok Depolama API v2 ile işlevsel olarak özdeştir. Sonraki API v3 mikrosürümleri, 3.1 gibi, API v2'den farklıdır.

source: The Domain of the project. This is a required part of the scope object.
tr_tr: Projenin Alanı. Bu, kapsam nesnesinin gerekli bir parçasıdır.

source: The Domain of the user.
tr_tr: Kullanıcının Alanı

source: The OpenStack project provides a command-line client that enables you to access APIs through easy-to-use commands. See the section called :ref:`client-intro`.
ja: OpenStack の各プロジェクトは、使いやすいコマンドから API にアクセスできるコマンドラインクライアントを提供しています。 :ref:`client-intro` を参照してください。
tr_tr: OpenStack projesi, kolay kullanılabilir komutlar yardımıyla API'lere erişmenizi sağlayan bir komut satırı istemcisi sağlar. :ref:`client-intro` isimli bölüme bakın.
zh_cn: OpenStack工程提供了一个能够让你通过简单命令去访问APIs的命令行客户端，请参考“client-intro”。

source: The Shared File Systems API v1 is functionally identical to the Shared File Systems API v2. Subsequent API v2 microversions, such as v2.1, differ from API v1.
ja: Shared File Systems API v2 は、Shared File Systems API v1 と同じ機能を提供します。将来の API v2 マイクロバージョン、v2.1 などは、API v1 と異なります。
tr_tr: Paylaşılan Dosya Sistemleri API v1, Paylaşılan Dosya Sistemleri API v2 ile işlevsel olarak özdeştir. Sonraki API v2 mikrosürümleri, v2.1 gibi, API v1'den farklıdır.
zh_cn: 共享文件系统API v1版本与 v2版本在功能上是一致的。随后的API v2微版本，例如v2.1，与API v1是不同的。

source: The example below uses an endpoint from an installation of Ocata by following the installation guide. However, you can also use ``$OS_AUTH_URL`` as an environment variable as needed to change the URL.
tr_tr: Aşağıdaki örnek kurulum rehberini takip ederek kurulan bir Ocata uç noktasını kullanır. Ancak, `$OS_AUTH_URL`` i URLi değiştirmek gerektiğinde ortam değişkeni olarak kullanabilirsiniz.

source: The examples in this section use cURL commands. For information about cURL, see http://curl.haxx.se/. For information about the OpenStack APIs, see :ref:`current_api_versions`.
ja: このセクションにある例では、cURL コマンドを使用します。cURL に関する情報は http://curl.haxx.se/ を参照してください。OpenStack API に関する情報は :ref:`current_api_versions` を参照してください。
tr_tr: Bu bölümdeki örnekler cURL komutları kullanıyor. cURL hakkında daha fazla bilgi için http://curl.haxx.se/ sayfasına bakın. OpenStack API'leri hakkında bilgi için, :ref:`current_api_versions` e bakın.

source: The following example shows a successful response:
ja: 以下は、成功した場合の応答例です。
tr_tr: Bir sonraki örnek başarılı bir cevabı göstermektedir:
zh_cn: 下面的例子展示了一个成功的响应：

source: The password for the user.
ja: ユーザーのパスワード。
tr_tr: Kullanıcının parolası
zh_cn: 该用户的密码。

source: The payload of credentials to authenticate contains these parameters:
ja: 認証のためのクレデンシャルのペイロードには、以下のパラメーターを指定します。
tr_tr: Kimlik doğrulama için kimlik bilgileri yükü bu parametreleri içerir:
zh_cn: 身份验证服务包含这些参数：

source: The project ID. Both the *project ID* and *Project Name* are optional. But one of them is required along with the *Project Domain*. They are wrapped under a scope object. If you do not know the project name or ID, send a request without any scope object.
tr_tr: *Proje Kimliği* (isteğe bağlı)

source: The project name. Both the *Project ID* and *Project Name* are optional.
tr_tr: Projenin adı. Hem *Proje Kimliği* hem de *Proje Adı* isteğe bağlıdır.

source: The token expires every hour by default, though it can be configured differently - see the ``expiration`` option in the ``Description of token configuration options`` section of the `Identity Service Configuration <https://docs.openstack.org/newton/config-reference/identity/options.html#keystone-token>`__ page.
ja: トークンはデフォルトでは 毎時間ごとに期限切れとなりますが、設定で変更が可能です - `Identity Service Configuration <https://docs.openstack.org/newton/config-reference/identity/options.html#keystone-token>`__ の ``Description of token configuration options`` セクション中の ``expiration`` オプションを参照してください。
tr_tr: Jeton varsayılan olarak her saatte zaman aşımına uğrar ancak farklı şekilde de ayarlanabilir - `Kimlik Servis Yapılandırması <https://docs.openstack.org/newton/config-reference/identity/options.html#keystone-token>`__ sayfasının ``Jeton yapılandırma seçeneklerinin tanımı` bölümünün ``zaman aşımı`` seçeneğine bakın.

source: The user name. If you do not provide a user name and password, you must provide a token.
ja: ユーザー名。ユーザー名とパスワードを指定しない場合は、トークンを指定する必要があります。
tr_tr: Kullanıcı adı. Eğer bir kullanıcı adı ve parola sağlamıyorsanız, bir jeton sağlamalısınız.
zh_cn: 用户名。如果您不提供用户名和密码，那么必须提供令牌。

source: Then, run this cURL command to request a token:
ja: 次に、この cURL コマンドを実行して、トークンをリクエストします。
tr_tr: Daha sonra, bir jeton istemek için bu cURL komutunu çalıştırın:
zh_cn: 然后，运行cURL命令去请求一个token。

source: Then, use the Compute API to list flavors, substituting the Compute API endpoint with one containing your project ID below:
ja: 次に、Compute API を使用してフレーバーを一覧表示します。Compute API のエンドポイントをお使いのプロジェクト ID に置き換えてください。
tr_tr: Daha sonra, nitelikleri listelemek için Hesaplama APIsini kullanın, aşağıdaki Hesaplama API ön ucunu kendi proje kimliğiniz ile değiştirerek:
zh_cn: 之后，可以使用计算服务API来列出所有的云主机类型，使用如下所示的包含在项目ID中的flavor来替换计算API端点

source: This section shows how to make some basic Compute API calls. For a complete list of Compute API calls, see `Compute API <https://developer.openstack.org/api-ref/compute/>`__.
ja: このセクションでは、基本的な Compute API コールの実行方法を示します。 Compute API コールの一覧は `Compute API <https://developer.openstack.org/api-ref/compute/>`__ を参照してください。
tr_tr: Bu bölüm bazı basit Hesaplama API çağrılarının nasıl yapılacağını gösterir. Hesaplama API çağrılarının bütün bir listesini görmek için `Hesaplama API <https://developer.openstack.org/api-ref/compute/>`__ ye bakın.

source: To authenticate access to OpenStack services, you must first issue an authentication request with a payload of credentials to OpenStack Identity to get an authentication token.
ja: OpenStack サービスへのアクセスの認証を行うには、まず最初に、ペイロードにクレデンシャルを指定して OpenStack Identity に認証リクエストを行って、認証トークンを取得する必要があります。
tr_tr: OpenStack servislerine erişim kimlik doğrulaması için, öncelikle OpenStack Kimlik'e kimlik doğrulama jetonu almak için kullanıcı bilgileri ile birlikte bir kimlik doğrulama isteğinde bulunmalısınız.
zh_cn: 为了认证对OpenStack服务的访问，你首先需要向OpenStack认证服务发出携带证书信息的认证请求以获得认证令牌。

source: To begin sending API requests, use one of the following methods:
ja: API リクエストを送信するには、以下の方法のいずれかを使用します。
tr_tr: API istekleri göndermeye başlamak için aşağıdaki yöntemlerden birini kullanabilirsiniz:
zh_cn: 使用如下的方法之一以发送 API 请求：

source: To launch an instance, note the IDs of your desired image and flavor.
ja: インスタンスの起動にあたり、使用したいイメージとフレーバーの ID を記録します。
tr_tr: Bir örnek başlatmak için istediğiniz imaj ve niteliğin kimliğini not edin.
zh_cn: 启动虚拟机实例前，记录下您所需的镜像和云主机类型的 ID。
