Repository: openstack/api-site
Catalog: api-quick-start/locale/*.po
Languages: de, el, es, it, ja, ko_kr

source: For complete information about the OpenStack clients, including how to source the <filename>openrc</filename> file, see <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, and <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
de: Für vollständige Informationen über die OpenStack Clients, inklusive wie man die <filename>openrc</filename> Datei einsourced, siehe <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack Endbenutzerhandbuch</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Administratorhandbuch</citetitle></link>, und <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Kommandozeilenschnittstelle Referenz</citetitle></link>.
es: Para obtener información completa acerca de los clientes OpenStack, incluyendo cómo usar el fichero <filename>openrc</filename>, consulte: <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, y <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
it: Per informazioni complete sui clienti OpenStack, tra cui come sorgente il <filename>openrc</filename> file, vedere <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>, <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, e <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
ja: <filename>openrc</filename> ファイルの読み込み方法など、OpenStack クライアントの詳細は、<link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>、<link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>、<link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link> を参照してください。
ko_kr: OpenStack 클라이언트와 <filename>openrc</filename> 파일에 포함된 내용에 대한 자세한 설명은 <link href="http://docs.openstack.org/user-guide/content/"><citetitle>OpenStack End User Guide</citetitle></link>와 <link href="http://docs.openstack.org/user-guide-admin/content/"><citetitle>OpenStack Admin User Guide</citetitle></link>, <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>에서 확인할 수 있습니다.

source: For information about the default ports that the OpenStack components use, see <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> in the <citetitle>OpenStack Configuration Reference</citetitle>.
de: Für Informationen über die von OpenStack verwendeten Standardports, siehe <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Anhang A. Firewalls und Standardports</citetitle></link> in der <citetitle>OpenStack Konfigurationsreferenz</citetitle>.
es: Para obtener información sobre los puertos que lo componentes de OpenStack usan por defecto, consulte: <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle> Anexo A. Firewalls y puertos por defecto</citetitle></link> en el documento <citetitle>OpenStack Configuration Reference</citetitle>.
it: Per informazioni sulle porte predefinite che i componenti usano OpenStack, vedere <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls e porte di default </citetitle></link> in <citetitle>OpenStack Configuration Reference</citetitle>.
ja: OpenStack のコンポーネントが使用するデフォルトポートについては、<citetitle>OpenStack Configuration Reference</citetitle> の <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> を参照してください。
ko_kr: OpenStack 구성 요소에서 사용하는 기본 포트들에 대한 자세한 내용은, <citetitle>OpenStack Configuration Reference</citetitle>의 <link href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>부록 A. 방화벽과 기본 포트들</citetitle></link>을 확인하세요.

source: Although you install each OpenStack service separately, the OpenStack services work together to meet your cloud needs: Identity, Compute, Image Service, Block Storage, Networking (neutron), Object Storage, Orchestration, and Telemetry. With the <link href="http://www.trystack.org/">TryStack</link> OpenStack installation, these services work together in the background of the installation.
de: Obwohl Sie jeden OpenStack Dienst getrennt installieren arbeiten die OpenStack Dienste zusammen, um Ihre Cloud Bedürfnisse zu erfüllen: Identität, Compute, Image Dienst, Block Speicher, Netzwerk (neutron), Objekt Speicher, Orchestrierung und Telemetrie. Mit der <link href="http://www.trystack.org/">TryStack</link> OpenStack Installation arbeiten diese Dienste im Hintergrund der Installation zusammen.
es: Aunque instale cada servicio de OpenStack por separado, los servicios de OpenStack: Identity, Compute, el Servicio de Imágenes, Almacenamiento de Bloques, Red (neutron), Almacenamiento de Objetos, Orquestación y Telemetría trabajan juntos para satisfacer sus necesidades en la nube. Con la instalación de OpenStack en <link href="http://www.trystack.org/">TryStack</link> estos servicios trabajan juntos en segundo plano.
it: Anche se si installa ciascun servizio OpenStack separatamente, i servizi di OpenStack lavorano insieme per soddisfare le vostre esigenze di cloud: Identity, Compute, Image Service, Block Storage, Networking (neutron), Object Storage, Orchestration, and Telemetry. Con l' <link href="http://www.trystack.org/">TryStack</link> OpenStack installazione, questi servizi lavorano insieme sullo sfondo dell'installazione.
ja: OpenStack の各サービスを別々にインストールした場合でも、OpenStack のサービスはクラウドの要件を満たすために協調して動作します。Identity、Compute、Image Service、Block Storage、Networking (neutron)、Object Storage、Orchestration、Telemetry があります。<link href="http://www.trystack.org/">TryStack</link> から OpenStack をインストールすると、これらのサービスはインストールのバックグラウンドで協調して動作します。
ko_kr: OpenStack 서비스들을 따로 설치하지만, OpenStack 서비스는 클라우드 서비스 요구에 만족시키기 위해, 다음 서비스들이 함께 작동합니다: Identity, Compute, 이미지 서비스, 블록 스토리지, 네트워킹 (neutron), 오브젝트 스토리지, Orchestration, Telemetry. <link href="http://www.trystack.org/">TryStack</link>을 이용해서 OpenStack을 설치한 경우, 백그라운드에서 같이 작동합니다.

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. For Chrome, see <link href="http://code.google.com/p/rest-client/">rest-client</link>.
de: Sowohl Mozilla wie auch Google bieten browserbasierte grafische Oberflächen für REST. Für Firefox, siehe <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. Für Chrome, siehe <link href="http://code.google.com/p/rest-client/">rest-client</link>.
es: Tanto Mozilla como Google proporcionan interfaces gráficos basados en el navegador para REST. Para más información sobre Firefox consulte: <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. Para más información sobre Chrome consulte: <link href="http://code.google.com/p/rest-client/">rest-client</link>.
it: Sia Mozilla e Google forniscono interfacce grafiche basate su browser per REST. Per Firefox, vedere <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. Per Chrome. vedere <link href="http://code.google.com/p/rest-client/">rest-client</link>.
ja: Mozilla と Google は、ブラウザーベースの REST 用グラフィカルインターフェースを提供しています。Firefox は <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link> を参照してください。Chrome は <link href="http://code.google.com/p/rest-client/">rest-client</link> を参照してください。
ko_kr: Mozilla와 Google은 모두 REST를 위한 브라우저 기반의 그래픽 인터페이스를 제공합니다. 파이어폭스는 <link href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>에서, 크롬은 <link href="http://code.google.com/p/rest-client/">rest-client</link>에서 자세한 내용을 확인할 수 있습니다.

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> in the <citetitle>OpenStack End User Guide</citetitle>.
de: Benutzen Sie dieses SDK um Python Automatisierungsskripte zu schreiben die Ressourcen in Ihrer OpenStack erstellen und verwalten können. Das SDK stellt eine Python Anbindung an die OpenStack API bereit womit Sie mit Python in der Lage sind automatisierte Aufgaben direkt durch Python Objekte anstatt durch REST-Aufrufe auszuführen. Alle OpenStack Kommandozeilentools verwenden selbst as Python SDK. Siehe <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> im <citetitle>OpenStack Endbenutzerhandbuch</citetitle>.
es: Utilice este SDK para escribir scripts de automatización en Python que creen y gestionen recursos en su nube OpenStack. El SDK implementa enlaces Python a las API de OpenStack, lo que le permite realizar tareas de automatización en Python realizando llamadas a objetos Python en vez de realizar llamadas REST. Todas las herramientas de línea de comandos se han implementado utilizándo el SDK de Python. Consulte: <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> en la <citetitle>OpenStack End User Guide</citetitle>.
it: Utilizzare questo SDK per scrivere script di automazione Python che creano e gestiscono le risorse nel cloud OpenStack. L'SDK implementa binding Python per la API OpenStack, che consente di eseguire compiti di automazione in Python effettuando chiamate su oggetti Python piuttosto che fare chiamate REST direttamente. Tutti gli strumenti da riga di comando OpenStack sono implementati utilizzando il Python SDK. Vedere<link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> nel <citetitle>OpenStack End User Guide</citetitle>.
ja: OpenStack クラウドでリソースの作成や管理を自動化する Python ツールを作成するために、SDK を使用します。SDK は OpenStack API への Python バインドを実装します。これにより、直接 REST コールを発行する代わりに、Python オブジェクトでコールを発行することにより、Python で自動化タスクを実行できます。すべての OpenStack コマンドラインツールは Python SDK を使用して実装されています。<citetitle>OpenStack End User Guide</citetitle> の <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> を参照してください。
ko_kr: OpenStack 클라우드에서 자원을 생성하고, 관리하는 데 필요한 Python 자동화 스크립트를 작성하기 위해서는 SDK를 사용하면 됩니다. SDK는 파이썬 객체를 호출하는 것이 아닌, REST를 직접 호출하도록 만들어져있으며, 파이썬을 사용하여 자동화 작업을 진행할 수 있도록 OpenStack API를 파이썬으로 바인딩하여 구현합니다. 모든 OpenStack 명령어 툴은 파이썬 SDK를 이용하여 구현됩니다. 자세한 내용은 <link href="http://docs.openstack.org/user-guide/content/ch_sdk.html">OpenStack Python SDK</link> in the <citetitle>OpenStack End User Guide</citetitle>에서 확인 가능합니다.

source: username (Optional)
de: Benutzername (optional)
es: nombre de usuario (Opcional)
ja: username (オプション)
ko_kr: 사용자 이름 (옵션)

source: password (Optional)
de: Passwort (optional)
es: contraseña (Opcional)
ja: password (オプション)
ko_kr: 비밀번호 (옵션)

source: The tenant ID. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>.
de: Die Mieter ID. Beide <placeholder-1/> und <placeholder-2/> sind optional, sollten aber nicht zusammen angegeben werden. Wenn beide Attribute angegeben sind antwortet der Server mit <placeholder-3/><placeholder-4/>.
es: El identificador del proyecto. Ambos atributos, <placeholder-1/> y <placeholder-2/> son opcionales, pero no deben especificarse juntos. Si se especifican ambos atributos el servidor responderá con un <placeholder-3/><placeholder-4/>.
ja: テナント ID。<placeholder-1/> と <placeholder-2/> はオプションです。ただし、同時に指定できません。両方の属性が指定された場合、サーバーは <placeholder-3/><placeholder-4/> を返します。
ko_kr: Tenant ID 입니다. <placeholder-1/>와 <placeholder-2/> 중 하나만 사용해야 합니다. 만약 둘 다 사용하게 되면 서버에서 <placeholder-3/><placeholder-4/>로 응답하게 됩니다.

source: The examples in this section use cURL commands. For information about cURL, see <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. For information about the OpenStack APIs, see <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
de: Die Beispiele in diesem Abschnitt verwenden cURL Kommandos. Für Informationen über cURL, siehe <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Für Informationen über die OpenStack APIs, siehe <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
es: Los ejemplos en esta sección utilizan comandos cURL. Para más información acerca de cURL, consulte: <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Para obtener información sobre las API de OpenStack consulte: <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
it: Gli esempi in questa sezione utilizzano i comandi cURL. Per informazioni su cURL, vedere <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Per informazioni sulle API di OpenStack, vedere <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
ja: このセクションにある例は、cURL コマンドを使用します。cURL に関する情報は <link href="http://curl.haxx.se/">http://curl.haxx.se/</link> を参照してください。OpenStack API に関する情報は <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link> を参照してください。
ko_kr: 이 섹션에서 예제는 cURL 명령을 사용합니다. cURL에 대한 자세한 정보는 <link href="http://curl.haxx.se/">http://curl.haxx.se/</link>에서 확인하세요. OpenStack API에 대한 자세한 정보는 <link href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>에서 확인하면 됩니다.

source: If you do not know your tenant name or ID, you can send an authentication request with an empty tenant, as follows:
de: Wenn Sie Ihren Mieternamen oder die Mieter-ID nicht kennen können Sie eine Authentifizierungsanfrage mit einem leeren Mieter wie folgt senden:
es: Si no conoce el nombre o ID de su proyecto, puede enviar una solicitud de autenticación con un proyecto vacío, de la siguiente forma:
ja: テナント名や ID が不明な場合、以下のようにテナント無しで認証リクエストを送信できます。
ko_kr: 만약 tenant 이름이나 ID를 모르는 경우, 빈 tenant와 인증 요청을 보낼 수 있습니다:

source: Use the Identity API to request a list of tenants, as follows:
de: Benutzen Sie die Identitäts-API wie folgt, um eine Liste von Mietern anzufragen:
es: Use el Identity API para solicitar una lista de proyectos, de la siguiente forma:
ja: テナント一覧をリクエストするために、以下のように Identity API を使用します。
ko_kr: Tenant 목록을 요청하려면, 다음과 같이 Identity API를 사용하면 됩니다:

source: Use the Identity API to request a list of endpoints, as follows:
de: Benutzen Sie die Identitäts-API wie folgt, um eine Liste von Endpunkten anzufragen:
es: Utilice el API Identity para solicitar un listado de puntos de acceso, de la siguiente forma:
ja: エンドポイント一覧をリクエストするために、以下のように Identity API を使用します。
ko_kr: Endpoint 목록을 요청하려면, 다음과 같이 Identity API를 사용하면 됩니다:

source: This section shows how to make some Identity API and Compute API calls. For a complete list of Identity API calls, see <link href="http://developer.openstack.org/api-ref-identity-v3.html">Identity APIs</link>. For a complete list of Compute API calls, see <link href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>.
ja: このセクションは、いくつかの Identity API と Compute API を呼び出す方法について説明します。Identity API コールの完全な一覧は、<link href="http://developer.openstack.org/api-ref-identity-v3.html">Identity APIs</link> を参照してください。Compute API コールの完全な一覧は、<link href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link> を参照してください。
ko_kr: 이 섹션에서는 Identity API를 만들고 Compute API 호출을 만드는 법에 대해서 보여줍니다. Identity API 호출에 대한 전체 목록을 확인하려면, <link href="http://developer.openstack.org/api-ref-identity-v3.html">Identity APIs</link> 를 확인하십시오. Compute API 호출에 대한 전체 목록을 확인하려면, <link href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>을 확인하십시오.

source: This section shows how to make some Identity API and Compute API calls. For a complete list of Identity API calls, see <link href="http://developer.openstack.org/api-ref-identity.html">Identity APIs</link>. For a complete list of Compute API calls, see <link href="http://developer.openstack.org/api-ref-compute.html">Compute APIs and Extensions</link>.
de: Dieser Abschnitt zeigt wie man einen Identitäts-API und Compute API Aufruf macht. Für eine vollständige Liste der Identitäts-API Aufrufe, siehe <link href="http://developer.openstack.org/api-ref-identity.html">Identitäts-APIs</link>. Für eine vollständige Liste der Compute API Aufrufe, siehe <link href="http://developer.openstack.org/api-ref-compute.html">Compute APIs und Erweiterungen</link>.
