Repository: openstack/api-site
Catalog: api-quick-start/locale/*.po
Languages: de, el, es, it, ja, ko_kr

source: A command-line tool that lets you send HTTP requests and receive responses. See <xref linkend="Compute_API_Quick_Start"/>.
de: Ein Kommandozeilentool mit dem Sie HTTP-Anfragen senden und empfangen können. Siehe <xref linkend="Compute_API_Quick_Start"/>.
el: Ένα εργαλείο γραμμής εντολών που σας επιτρέπει να στέλνετε αιτήματα HTTP και να λαμβάνετε απαντήσεις. Δείτε <xref linkend="Compute_API_Quick_Start"/>.
es: Una utilidad de línea de comando que le permite enviar peticiones HTTP y recibir respuestas. Consulte <xref linkend="Compute_API_Quick_Start"/>.
it: Uno strumento da riga di comando che consente di inviare richieste HTTP e ricevere risposte. Vedere <xref linkend="Compute_API_Quick_Start"/>.
ja: HTTP リクエストを送信し、レスポンスを受信できるコマンドラインツール。<xref linkend="Compute_API_Quick_Start"/> を参照してください。
ko_kr: HTTP 요청을 보내고, 응답을 받을 수 있도록 해주는 명령 줄 도구입니다. 자세한 설명은 <xref linkend="Compute_API_Quick_Start"/>에서 확인할 수 있습니다.

source: A token. If you do not provide a token, you must provide a user name and password.
de: Ein Token. Wenn Sie kein Token verwenden müssen Sie Benutzername und Passwort angeben.
el: Κωδικός επαλήθευσης ταυτότητας. Αν δεν παράσχετε κωδικό επαλήθευσης ταυτότητας, πρέπει να παράσχετε όνομα χρήστη και κωδικό πρόσβασης.
es: Un token de autenticación. Si no proporciona un token debe proporcionar un nombre de usuario y una contraseña.
it: Un biglietto. Se non si fornisce un biglietto, è necessario fornire un nome utente e una password.
ja: トークン。トークンを指定しない場合、ユーザー名とパスワードを指定する必要があります。
ko_kr: 토큰. 토큰을 제공하지 않는 경우, 사용자 이름과 비밀번호를 제공해야 합니다.

source: After you authenticate through Identity, you can use the other OpenStack APIs to create and manage resources in your OpenStack cloud. You can launch instances from images and assign metadata to instances through the Compute API or the <placeholder-1/> command-line client.
de: Nach dem Sie sich über Identität authentifiziert haben können Sie die anderen OpenStack APIs verwenden, um Resourcen in Ihrer OpenStack Cloud zu erstellen und zu verwalten. Sie können Instanzen von Images starten und Metadaten, durch die Compute API oder den <placeholder-1/> Kommandozeilenclient, Ihren Instanzen zuweisen.
el: Εφόσον πιστοποιήσετε την αυθεντικότητα μεσώ της Ταυτοποίησης, μπορείτε να χρησιμοποιήσετε άλλα API της OpenStack για να δημιουργήσετε και να διαχειριστείτε τους πόρους στο cloud του OpenStack σας. Μπορείτε να κάνετε έναρξη εικονικών μηχανημάτων από images και να αναθέσετε μεταδεδομένα σε εικονικά μηχανήματα μεσώ του Υπολογιστικού API ή του <placeholder-1/> λογισμικού γραμμής εντολών.
es: Después de autenticarse contra el servicio Identiy, puede usar las otras API de OpenStack para crear y administrar los recursos de su nube OpenStack. Puede iniciar instancias desde imágenes y asignar metadatos a las instancias mediante el API del servicio Compute o el cliente de línea de comandos <placeholder-1/>.
it: Dopo l'autenticazione attraverso Identity, è possibile utilizzare le altre API OpenStack per creare e gestire le risorse nel cloud OpenStack. È possibile avviare le istanze di immagini e assegnare metadati alle istanze attraverso l'API Compute o <placeholder-1/> cliente a riga di comando.
ja: Identity 経由で認証した後、OpenStack クラウドにリソースを作成、管理するために、他の OpenStack API を使用できます。Compute API または <placeholder-1/> コマンドラインクライアントを用いて、イメージからインスタンスを起動し、メタデータをインスタンスに割り当てられます。
ko_kr: Identity에서 인증한 후, OpenStack API를 사용하여 생성하고, OpenStack 클라우드의 리소스를 관리할 수 있습니다. 이미지로 인스턴스를 작동시키고 Compute API 또는 <placeholder-1/> 명령어 클라이언트를 이용하여 메타 데이터를 할당할 수 있습니다.

source: Although you install each OpenStack service separately, the OpenStack services work together to meet your cloud needs: Identity, Compute, Image service, Block Storage, Networking (neutron), Object Storage, Orchestration, and Telemetry. With the <link xlink:href="http://www.trystack.org/">TryStack</link> OpenStack installation, these services work together in the background of the installation.
el: Παρόλο που εγκαθιστάτε κάθε υπηρεσία OpenStack ξεχωριστά, οι υπηρεσίες OpenStack συνεργάζονται για να καλύψουν τις ανάγκες του cloud σας: Ταυτοποίηση, Υπολογιστική, Υπηρεσία Image, Αποθήκευσης κατά Συστάδα, Δικτύωσης (neutron), Πλατφόρμα αποθήκευσης δεδομένων, Ενορχήστρωση και Τηλεμετρία. Με την <link xlink:href="http://www.trystack.org/">TryStack</link> εγκατάσταση του OpenStack, αυτές οι υπηρεσίες συνεργάζονται στο πλαίσιο της εγκατάστασης.

source: Authenticate
de: Authentifizieren
el: Πιστοποιήστε
es: Autenticar
it: Autenticare
ja: 認証
ko_kr: 인증

source: Authentication and API request workflow
de: Authentifizierung und Ablauf der API Anfragen
el: Πιστοποίηση και αίτημα ροής εργασιών API
es: Autenticación y API de solicitud de flujo de trabajo
it: Autenticazione e richiesta API flusso di lavoro
ja: 認証と API リクエストのワークフロー
ko_kr: 인증과 API 요청 작업 흐름

source: Bad Request
de: Fehlerhafte Anfrage
el: Εσφαλμένο Αίτημα
es: Petición errónea
it: Brutta richiesta
ko_kr: 잘못된 요청

source: Before you can issue client commands, you must download and source the <filename>openrc</filename> file to set environment variables.
de: Bevor Sie Kommandos mit dem Client verwenden können müssen Sie die <filename>openrc</filename> Datei downloaden und einsourcen um die Umgebungsvariablen zu setzen.
el: Προτού μπορέσετε να χρησιμοποιήσετε εντολές λογισμικού, πρέπει να κατεβάσετε και να κάνετε source το αρχείο <filename>openrc</filename> για να καθορίσετε τις μεταβλητές περιβάλλοντος.
es: Antes de que pueda ejecutar comandos del cliente debe descargar el fichero <filename>openrc</filename> y usarlo como origen para configurar las variables de entorno.
it: Prima di poter inviare comandi cliente, è necessario scaricare e sorgente di <filename>openrc</filename> per impostare le variabili di ambiente.
ja: クライアントコマンドを発行する前に、環境変数を設定するために、<filename>openrc</filename> ファイルをダウンロードして、読み込みます。
ko_kr: 클라이언트 명령을 실행하기 전에 환경 변수 설정하는 파일인 <filename>openrc</filename> 파일을 작성하거나 내려받아 source 명령으로 적용합니다.

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see <link xlink:href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">RESTClient</link>. For Chrome, see <link xlink:href="http://code.google.com/p/rest-client/">rest-client</link>.
el: Και ο Mozilla και η Google προσφέρουν για τον REST γραφικές διεπαφές βασισμένες σε προγράμματα περιήγησης. Για τον Firefox, δείτε <link xlink:href="https://addons.mozilla.org/en-US/firefox/addon/restclient/">ΛογισμικόREST</link>. Για τον Chrome, δείτε <link xlink:href="http://code.google.com/p/rest-client/">rest-λογισμικό</link>.

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the tenant in which your cloud runs. Ask your cloud administrator for your user name, password, and tenant so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
de: Ein Berechtigungsnachweis ist im Allgemeinen eine Kombination aus Benutzername und Passwort sowie optional der Name oder die ID des Mieters, welcher die Cloud betreibt. Fragen Sie Ihren Cloud Administrator nach Ihrem Benutzernamen, Ihrem Passwort und dem Mieternamen so dass Sie einen Authentifizierungstoken generieren können. Alternativ können Sie auch direkt einen Token anstatt dem Benutzernamen und Passwort angeben.
el: Διαπιστευτήρια είναι συνήθως ένας συνδυασμός του ονόματος χρήστη και του κωδικού πρόσβασής σας και προαιρετικά, το όνομα ή την ταυτότητα των οργανωτικών μονάδων στις οποίες μπορείτε να ορίσετε τους χρήστες και μέσω των οποίων εκτελείται το cloud σας. Ζητήστε από τον διαχειριστή του cloud σας το όνομα χρήστη, τον κωδικό πρόσβασης και την οργανωτική σας μονάδα ώστε να μπορέσετε να παράγετε κωδικούς επαλήθευσης ταυτότητας. Εναλλακτικά, μπορείτε να παράσχετε έναν κωδικό επαλήθευσης ταυτότητας αντί για όνομα χρήστη και κωδικό πρόσβασης.
es: Normalmente las credenciales son una combinación de su nombre de usuario y su contraseña y, de forma adicional, el nombre o identificador del proyecto bajo el cual funciona su nube. Pregunte al administrador de su nube por su nombre de usuario, contraseña y proyecto de manera que pueda crearse sus tokens de autenticación. Alternativamente, se puede proporcionar un token en lugar de un nombre de usuario y contraseña.
it: Le credenziali sono di solito una combinazione di nome utente e password, e, facoltativamente, il nome o l'ID del locatario in cui la vostra nuvola gira. Chiedere all'amministratore cloud per il nome utente, la password e l'inquilino in modo da poter generare i biglietti di autenticazione. In alternativa, è possibile fornire un biglietto piuttosto che un nome utente e una password.
ja: クレデンシャルは一般的に、ユーザー名とパスワードの組み合わせです。オプションとして、クラウドを実行するテナントの名前や ID を指定します。認証トークンを生成できるよう、あなたのユーザー名、パスワード、テナントをクラウド管理者に問い合わせます。ユーザー名とパスワードの代わりに、トークンを指定することもできます。
ko_kr: Credential은 일반적으로 사용자 이름과 비밀번호의 조합으로 사용되지만 추가적으로 tenant의 이름 또는 ID를 가지고서 클라우드에서 동작됩니다. 당신이 인증 토큰을 생성할 수 있도록 사용자 이름, 비밀번호, tenant를 클라우드 관리자에게 문의하십시오. 또는, 사용자 이름과 비밀번호말고 토큰을 제공할 수 있습니다.

source: Description
de: Beschreibung
el: Περιγραφή
es: Descripción
it: Descrizione
ja: 説明
ko_kr: 설명

source: Each OpenStack project provides a command-line client that enables you to access its API through easy-to-use commands. See <xref linkend="cli-intro"/>.
de: Jedes OpenStack Projekt stellt einen Kommandozeilenclient bereit mit dem Sie in der Lage sind auf die API durch einfache Befehle zuzugreifen. Siehe <xref linkend="cli-intro"/>.
el: Κάθε οργανωτική μονάδα Openstack προσφέρει ένα λογισμικό γραμμής εντολών που σας επιτρέπει να έχετε πρόσβαση στο API μέσω εντολών εύκολης χρήσης. Δείτε <xref linkend="cli-intro"/>.
es: Cada proyecto OpenStack proporciona un cliente de línea de comandos que le permite acceder a su API a través de comandos fáciles de usar. Consulte <xref linkend="cli-intro"/>.
it: Ogni progetto OpenStack fornisce un client a riga di comando che consente di accedere alla sua API tramite comandi facili da usare. Vedere <xref linkend="cli-intro"/>.
ja: OpenStack の各プロジェクトは、使いやすいコマンドから API にアクセスできるコマンドラインクライアントを提供します。<xref linkend="cli-intro"/> を参照してください。
ko_kr: 각 OpenStack 프로젝트에서 쉬운 명령을 이용하여 해당 API를 사용할 수 있는 명령 줄 클라이언트를 제공합니다. 자세한 내용은 <xref linkend="cli-intro"/>에서 확인할 수 있습니다.

source: For a typical OpenStack deployment that runs Identity, use a cURL command like the following command to request a token:
de: Für eine typische OpenStack Installation welche Identity verwendet, benutzen Sie ein cURL Kommando wie die folgenden Kommandos um einen Token anzufragen:
el: Για μια τυπική εγκατάσταση OpenStack που εκτελεί Ταυτοποίηση, χρησιμοποιήστε μια cURL εντολή όπως η παρακάτω εντολή, για να ζητήσετε κωδικό επαλήθευσης ταυτότητας.
es: En un despliegue típico de OpenStack en el que ejecute Identity, utilice un comando cURL como el siguiente, para solicitar un token:
it: Per una distribuzione tipica OpenStack che gir Identity, utilizzare un comando cURL come il seguente comando per richiedere un biglietto:
ja: Identity を実行している一般的な OpenStack 環境の場合、トークンをリクエストするために、以下のような cURL コマンドを使用します。
ko_kr: Identity를 사용하여 일반적인 OpenStack 배포하는 경우, cURL 명령을 사용하여 다음과 같이 토큰을 요청할 수 있습니다:

source: For complete information about the OpenStack clients, including how to source the <filename>openrc</filename> file, see <link xlink:href="http://docs.openstack.org/user-guide/"><citetitle>OpenStack End User Guide</citetitle></link>, <link xlink:href="http://docs.openstack.org/user-guide-admin/"><citetitle>OpenStack Admin User Guide</citetitle></link>, and <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
el: Για πλήρεις πληροφορίες σχετικά με τα λογισμικά OpenStack, συμπεριλαμβανομένου και του τρόπου να κάνετε source το αρχείο <filename>openrc</filename>, δείτε τo <link xlink:href="http://docs.openstack.org/user-guide/"><citetitle>Εγχειρίδιο Τελικού Χρήστη OpenStack</citetitle></link>, <link xlink:href="http://docs.openstack.org/user-guide-admin/"><citetitle>Eγχειρίδιο Χρήσης Διαχειριστή OpenStack, και <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>Αναφορά Διεπαφής γραμμής εντολών OpenStack</citetitle></link>.

source: For example, to install the <placeholder-1/> client, run this command:
de: Um beispielsweise den <placeholder-1/> Client zu installieren, führen Sie dieses Kommando aus:
el: Για παράδειγμα, για να εγκαταστήσετε το λογισμικό <placeholder-1/>, εκτελέστε αυτή την εντολή:
es: Por ejemplo, para instalar el cliente <placeholder-1/>, ejecute este comando:
it: Ad esempio, per installare il <placeholder-1/> cliente, eseguire questo comando:
ja: 例えば、<placeholder-1/> クライアントをインストールする場合、このコマンドを実行します。
ko_kr: 예를 들어, <placeholder-1/> 클라이언트를 설치한다면, 다음 명령을 실행합니다:

source: For information about the command-line clients, see <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
el: Για πληροφορίες σχετικά με τα λογισμικά γραμμής εντολών, δείτε <link xlink:href="http://docs.openstack.org/cli-reference/content/"><citetitle>Αναφορά Διεπαφής Γραμμής Εντολών OpenStack</citetitle></link>.

source: For information about the default ports that the OpenStack components use, see <link xlink:href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Appendix A. Firewalls and default ports</citetitle></link> in the <citetitle>OpenStack Configuration Reference</citetitle>.
el: Για πληροφορίες σχετικά με τις προεπιλεγμένες θύρες τις οποίες χρησιμοποιούν οι συνιστώσες του OpenStack, δείτε <link xlink:href="http://docs.openstack.org/trunk/config-reference/content/firewalls-default-ports.html"><citetitle>Παράρτημα Α. Τα τείχη προστασίας και οι προεπιλεγμένες θύρες </citetitle></link> στην <citetitle>Αναφορά Ρύθμισης Παραμέτρων του OpenStack </citetitle>.

source: For scripting work, you can use a command-line client like the <systemitem role="client">python-novaclient</systemitem> client. This client enables you to use the Compute API through a command-line interface.
de: Für Skriptingarbeiten können Sie einen Kommandozeilenclient wie den <systemitem role="client">python-novaclient</systemitem> verwenden. Dieser Client ermöglicht Ihnen die Compute API durch eine Kommandozeileneingabe zu nutzen.
el: Για εργασία δέσμης ενεργειών, μπορείτε να χρησιμοποιήσετε ένα λογισμικό γραμμής εντολών όπως το <systemitem role="client">python-novaclient</systemitem> πρόγραμμα. Αυτό το λογισμικό σας δίνει τη δυνατότητα να χρησιμοποιήσετε το Υπολογιστικό API μεσώ μιας διεπαφής γραμμής εντολών.
es: Para trabajar con scripts puede usar un cliente de línea de comandos como el cliente <systemitem role="client">python-novaclient</systemitem>. Este cliente le permite usar la API de Compute a través del interfaz de línea de comandos.
it: Per il lavoro di script, è possibile utilizzare un client a riga di comando come il <systemitem role="client">python-novaclient</systemitem> cliente. Questo cliente consente di utilizzare l'API Compute tramite un'interfaccia a riga di comando.
ja: スクリプト作成のために、<systemitem role="client">python-novaclient</systemitem> クライアントなどのコマンドラインクライアントを使用できます。このクライアントにより、コマンドラインインターフェースから Compute API を使用できます。
ko_kr: 스크립트 작업의 경우, <systemitem role="client">python-novaclient</systemitem> 클라이언트와 같은 명령 줄 클라이언트를 사용할 수 있습니다. 명령 줄 인터페이스를 이용하는 이 클라이언트로 Compute API를 사용할 수 있습니다.

source: If the <errorcode>401</errorcode><errortext>Unauthorized</errortext> error occurs, request another token.
de: Wenn der <errorcode>401</errorcode><errortext>Unauthorized</errortext> Fehler auftritt, fordern sie einen neuen Token an.
el: Άν το <errorcode>401</errorcode><errortext>Unauthorized</errortext> σφάλμα παρουσιαστεί, ζητήστε άλλον κωδικό επαλήθευσης ταυτότητας.
es: si ocurre un error: <errorcode>401</errorcode><errortext>Unauthorized</errortext> solicite otro token.
it: Se il <errorcode>401</errorcode><errortext>Unauthorized</errortext> errore si verifica, chiedere un altro biglietto.
ja: <errorcode>401</errorcode><errortext>Unauthorized</errortext> エラーが発生した場合、別のトークンをリクエストします。
ko_kr: 만약 <errorcode>401</errorcode> <errortext>Unauthorized</errortext> 에러가 발생하게 되면, 다른 토큰을 요청합니다.

source: If the request succeeds, the server returns an authentication token.
de: Bei einer erfolgreichen Anfrage erwidert der Server mit einem Authentifizierungstoken.
el: Αν το αίτημα είναι επιτυχές, ο διακομιστής θα σας απαντήσει με έναν κωδικό επαλήθευσης ταυτότητας.
es: Si la petición se realiza correctamente, el servidor devuelve un token de autenticación
it: Se la richiesta ha esito positivo, il server restituisce un biglietto di autenticazione.
ja: リクエストに成功すると、サーバーは認証トークンを返します。
ko_kr: 요청이 성공하면, 서버는 인증 토큰을 반환해줍니다.

source: If the request succeeds, you receive a <returnvalue>200 OK</returnvalue> response followed by a response body that contains a token in the form <code>"id":"<replaceable>token</replaceable>"</code> and an expiration date and time in the form <code>"expires":"<replaceable>datetime</replaceable>"</code>.
de: Wenn die Anfrage erfolgreich ist erhalten Sie eine <returnvalue>200 OK</returnvalue> Antwort, gefolgt durch einen Hauptteil welcher einen Token in Form von <code>"id":"<replaceable>token</replaceable>"</code> und ein Ablaufdatum in der Form <code>"expires":"<replaceable>datetime</replaceable>"</code> enthält.
el: Αν η αίτηση επιτύχει, θα λάβετε μια απάντηση <returnvalue>200 OK</returnvalue> που θα ακολουθηθεί από έναν όγκο ανταπόκρισης που εμπεριέχει έναν κωδικό επαλήθευσης ταυτότητας σε μορφή <code>"id":"<replaceable>token</replaceable>"</code> και μια ημερομηνία και ώρα λήξης σε μορφή <code>"expires":"<replaceable>datetime</replaceable>"</code>.
es: Si la petición finaliza correctamente recibirá una respuesta <returnvalue>200 OK</returnvalue> seguida por una respuesta que incluyen en su cuerpo un token en la forma <code>"id":"<replaceable>token</replaceable>"</code> y una fecha y hora de caducidad del token en la forma <code>"expires":"<replaceable>datetime</replaceable>"</code>.
it: Se la richiesta ha esito positivo, ricevete un <returnvalue>200 OK</returnvalue> risposta seguita da un corpo di risposta che contiene un biglietto nella forma <code>"id":"<replaceable>token</replaceable>"</code> e una data di scadenza con l'ora nella forma <code>"expires":"<replaceable>datetime</replaceable>"</code>.
ja: リクエストに成功すると、<returnvalue>200 OK</returnvalue> 応答を受け取ります。続くレスポンス本体に <code>"id":"<replaceable>token</replaceable>"</code> 形式のトークンと <code>"expires":"<replaceable>datetime</replaceable>"</code> 形式の期限切れ日時が含まれます。
ko_kr: 요청이 성공하면, <returnvalue>200 OK</returnvalue> 응답 후, 토큰 형식은 <code>"id":"<replaceable>token</replaceable>"</code>으로, 만료 날짜와 시간 형식은 <code>"expires":"<replaceable>datetime</replaceable>"</code>으로 본문에서 보여주게 됩니다.

source: If you do not know your tenant name or ID, you can send an authentication request with an empty tenantName, as follows:
el: Αν δεν γνωρίζετε το όνομα ή την ταυτότητα της οργανωτικής μονάδας του cloud σας, μπορείτε να στείλετε αίτημα πιστοποίησης με άδειο όνομα tenantName, όπως ακολουθεί.

source: Install the clients
de: Installiere die Clients
el: Εγκαταστήστε τα λογισμικά
es: Instale los clientes
it: Installare i clienti
ja: クライアントのインストール
ko_kr: 클라이언트 설치

source: Launch an instance
de: Starten Sie eine Instanz:
el: Έναρξη εικονικής μηχανής
es: Lazar una instancia
it: Avviare un'istanza
ja: インスタンスの起動
ko_kr: 인스턴스 실행

source: OpenStack API Quick Start
de: OpenStack API Schnellstart
el: OpenStack API Γρήγορη Εκκίνηση
es: OpenStack API. Guía de inicio rápido.
ja: OpenStack API クイックスタート
ko_kr: OpenStack API 빠른 시작

source: OpenStack APIs
el: OpenStack API
es: APIs de OpenStack
ja: OpenStack API
ko_kr: OpenStack API

source: OpenStack Python Software Development Kit (SDK)
el: OpenStack Python Εργαλεία Ανάπτυξης Λογισμικού (SDK)
ko_kr: OpenStack 파이썬 소프트웨어 개발 도구 (SDK)

source: OpenStack command-line clients
de: OpenStack Kommandozeilenclients
el: Λογισμικά γραμμής εντολών OpenStack
es: Clientes de la línea de comandos de OpenStack.
it: OpenStack clienti a riga di comando
ja: OpenStack コマンドラインクライアント
ko_kr: OpenStack 명령 줄 클라이언트

source: PROJECT
de: PROJEKT
el: Οργανωτική Μονάδα του cloud
es: PROYECTO

source: Parameter
el: Παράμετρος
es: Parámetro
it: Parametro
ja: パラメーター
ko_kr: 매개 변수

source: REST clients
el: REST λογισμικά
es: Clientes REST
it: REST clienti
ja: REST クライアント
ko_kr: REST 클라이언트

source: Request an authentication token from the Identity endpoint that your cloud administrator gave you. Send a payload of credentials in the request:
de: Fragt einen Authentifizierungstoken from Identitätsendpunkt an, welcher Ihnen von Ihrem Cloud Administrator geben wurde. Sendet den Berechtigungsnachweis bei der Anfrage mit:
el: Ζητήστε έναν κωδικό επαλήθευσης ταυτότητας από την Παράμετρο Ταυτότητας που σας έδωσε ο διαχειριστής του cloud σας. Στείλτε τις απαραίτητες πληροφορίες και διαπιστευτήρια στην αίτηση.
es: Solicite un token de autenticación al punto de acceso del servicio Identity que el administrador de su nube le facilitó. Envíe las credenciales en la petición:
it: Richiedi un biglietto di autenticazione dal punto finale di identità che l'amministratore della nube vi ha dato. Invia un carico utile di credenziali nella richiesta:
ja: クラウド管理者が指定した Identity エンドポイントから認証トークンをリクエストします。リクエストでクレデンシャルのペイロードを送信します。
ko_kr: 클라우드 관리자가 발급한 Identity 엔드 포인트에서 인증 토큰을 요청합니다. 요청할 때, credential의 payload 보냅니다:

source: Run this command to install or update a client package:
de: Führen Sie dieses Kommando aus um ein Client-Paket zu installieren oder zu aktualisieren:
el: Εκτελέστε αυτή την εντολή για να εγκατασταθεί ή να αναβαθμιστεί το λογισμικό:
es: Ejecute este comando para instalar o actualizar un paquete de cliente:
it: Eseguire questo comando per installare o aggiornare un pacchetto client:
ja: クライアントパッケージをインストールまたは更新するために、このコマンドを実行します。
ko_kr: 클라이언트 패키지를 설치하거나 업데이트하려면 다음 명령을 실행하십시오:

source: Send API requests
de: Sende API Anfragen
el: Στείλετε αιτήματα API
es: Envía peticiones al API
it: Invio richiesta API
ja: API リクエストの送信
ko_kr: API 요청 보내기

source: Send API requests and include the token in the <literal>X-Auth-Token</literal> header. Continue to send API requests with that token until the job completes or a <errorcode>401</errorcode><errortext>Unauthorized</errortext> error occurs.
de: Senden Sie API Anfragen und schließen Sie das Token im <literal>X-Auth-Token</literal> Header ein. Fahren Sie fort API Anfragen mit diesem Token zu senden bis die Aufgabe erledigt ist oder ein <errorcode>401</errorcode><errortext>Unauthorized</errortext> Fehler auftritt.
el: Στείλτε αίτηση API και συμπεριλάβετε τον κωδικό επαλήθευσης ταυτότητας στην <literal>X-Auth-Token</literal> κεφαλίδα. Συνεχίστε να στέλνετε αιτήσεις με αυτό τον κωδικό μέχρι η εργασία να ολοκληρωθεί ή να προκύψει σφάλμα <errorcode>401</errorcode><errortext>Unauthorized</errortext>.
es: Envíe peticiones al API e incluya el token en la cabecera <literal>X-Auth-Token</literal>. Continúe enviando peticiones al API con ese token hasta que el trabajo finalice o se produzca un error <errorcode>401</errorcode><errortext>Unauthorized</errortext>
it: Invia richieste API e includere il biglietto nel <literal>X-Auth-Token</literal> intestazione. Continuate a inviare le richieste API con quel biglietto fino al completamento del lavoro o si verifica un <errorcode>401</errorcode> <errortext>Unauthorized</errortext> errore.
ja: API リクエストを送信し、<literal>X-Auth-Token</literal> ヘッダーにトークンを含めます。作業が完了するか、<errorcode>401</errorcode><errortext>Unauthorized</errortext> エラーが発生するまで、そのトークンを用いて API リクエストを送信し続けます。
ko_kr: API 요청할 때, <literal>X-Auth-Token</literal> 해더에 토큰이 포함됩니다. 작업이 완료되거나 <errorcode>401</errorcode> <errortext>Unauthorized</errortext> 에러가 발생할 때까지 토큰을 이용하여 API 요청을 보냅니다.
