Repository: openstack/api-site
Catalog: api-quick-start/locale/*.po
Languages: de, el, es, it, ja, ko_kr

source: The examples in this section use cURL commands. For information about cURL, see <link xlink:href="http://curl.haxx.se/">http://curl.haxx.se/</link>. For information about the OpenStack APIs, see <link xlink:href="http://developer.openstack.org/api-ref.html">OpenStack API Reference</link>.
el: Τα παραδείγματα σε αυτό το μέρος χρησιμοποιούν cURL εντολές. Για πληροφορίες σχετικά με το cURL, δείτε <link xlink:href="http://curl.haxx.se/">http://curl.haxx.se/</link>. Για πληροφορίες σχετικά με τα API της OpenStack, δείτε <link xlink:href="http://developer.openstack.org/api-ref.html">Αναφορά στα API της OpenStack</link>.

source: The following example shows a successful response:
de: Das folgenden Beispiel zeigt eine erfolgreiche Antwort:
el: Το παρακάτω παράδειγμα δείχνει μια επιτυχή απάντηση:
es: El siguiente ejemplo muestra una respuesta correcta:
it: L'esempio seguente mostra una risposta positiva:
ja: 以下の例は、成功した場合の応答です。
ko_kr: 다음은 성공한 응답을 보여줍니다:

source: The password for the user.
de: Das Passwort des Benutzers.
el: Ο κωδικός πρόσβασης του χρήστη.
es: La contraseña del usuario
it: La password per l'utente.
ja: ユーザーのパスワード。
ko_kr: 사용자의 비밀번호입니다.

source: The tenant ID. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>. If you do not know the tenantId, you can send a request with "" for the tenantId and get the ID returned to you in the response.
el: Την ταυτότητα της οργανωτικής μονάδας του Cloud. Και το <placeholder-1/>, και το <placeholder-2/> είναι προαιρετικά, αλλά δεν πρέπει να διευκρινίζονται ταυτόχρονα. Αν και οι δύο αυτές ιδιότητες διευκρινίζονται, o διακομιστής απαντά με <placeholder-3/><placeholder-4/>. Αν δεν γνωρίζετε την ΤαυτότηταΟργανωτικήςΜονάδας, μπορείτε να στείλετε ένα αίτημα με "" για την ΤαυτότηταΟργανωτικήςΜονάδας και να σας επιστραφεί η ταυτότητα ως απάντηση.

source: The tenant name. Both the <placeholder-1/> and <placeholder-2/> are optional, but should not be specified together. If both attributes are specified, the server responds with a <placeholder-3/><placeholder-4/>.
de: Der Mietername. Beide, der <placeholder-1/> und <placeholder-2/> sind optional, sollten aber nicht zusammen angegeben werden. Wenn beide Attribute angegeben sind antwortet der Server mit <placeholder-3/><placeholder-4/>.
el: Το όνομα της οργανωτικής μονάδας του Cloud. Και το <placeholder-1/>, και το <placeholder-2/> είναι προαιρετικά, αλλά δεν πρέπει να διευκρινίζονται ταυτόχρονα. Αν και οι δύο αυτές ιδιότητες διευκρινίζονται, o διακομιστής απαντά με <placeholder-3/><placeholder-4/>.
es: El nombre del proyecto. Ambos atributos, <placeholder-1/> y <placeholder-2/> son opcionales, pero no deben especificarse juntos. Si se especifican ambos atributos el servidor responderá con un <placeholder-3/><placeholder-4/>.
it: Il nome del locatario. Sia il <placeholder-1/> e <placeholder-2/> sono opzionali, ma non dovrebbero essere specificati insieme. Se vengono specificati entrambi gli attributi, il server risponde con un <placeholder-3/><placeholder-4/>.
ja: テナント名。<placeholder-1/> と <placeholder-2/> はオプションです。ただし、同時に指定できません。両方の属性が指定された場合、サーバーは <placeholder-3/><placeholder-4/> を返します。
ko_kr: Tenant 이름입니다. <placeholder-1/>와 <placeholder-2/>중 하나만 선택해서 사용해야 합니다. 만약 둘 다 사용할 경우, 서버에서는 <placeholder-3/> <placeholder-4/>로 응답합니다.

source: The user name. If you do not provide a user name and password, you must provide a token.
de: Der Benutzername. Wenn Sie keinen Benutzernamen und Passwort angeben, müssen Sie ein Token verwenden.
el: Το όνομα χρήστη. Αν δεν παράσχετε όνομα χρήστη ή κωδικό πρόσβασης, πρέπει να παράσχετε κωδικό επαλήθευσης ταυτότητας.
es: El nombre de usuario. Si no proporciona un nombre de usuario y una contraseña debe proporcionar un token de autenticación.
it: Il nome utente. Se non si specifica un nome utente e una password, è necessario fornire un biglietto.
ja: ユーザー名。ユーザー名とパスワードを指定しない場合、トークンを指定する必要があります。
ko_kr: 사용자 이름입니다. 만약 사용자 이름과 암호를 제공하지 않는다면, 토큰을 제공해야 합니다.

source: This section shows how to make some basic Compute API calls. For a complete list of Compute API calls, see <link xlink:href="http://developer.openstack.org/api-ref-compute-v2.html">Compute APIs and Extensions</link>.
el: Αυτό το μέρος δείχνει πως να εκτελέσετε κάποια βασικά Υπολογιστικά API. Για μια ολοκληρωμένη λίστα των Υπολογιστικών API, δείτε <link xlink:href="http://developer.openstack.org/api-ref-compute-v2.html">Υπολογιστικά API και επεκτάσεις</link>.

source: To authenticate access to OpenStack services, you must first issue an authentication request to OpenStack Identity to acquire an authentication token. To request an authentication token, you must supply a payload of credentials in the authentication request.
de: Um den Zugriff auf die OpenStack Dienste zu authentifizieren müssen Sie erst eine Authentifizierungsanfrage an OpenStack Identity für einen Authentifizierungs-Token stellen. Um einen Authentifizierungs-Token anzufragen müssen Sie den Berechtigungsnachweis als Nutzdaten in der Authentifizierungsanfrage mitsenden.
el: Για να επικυρώσετε την πρόσβαση στις υπηρεσίες OpenStack, πρέπει πρώτα να υποβάλετε αίτημα πιστοποίησης στην OpenStack Identity για να αποκτήσετε κωδικό επαλήθευσης ταυτότητας. Για να ζητήσετε κωδικό επαλήθευσης ταυτότητας, πρέπει να παράσχετε στην αίτηση πιστοποίησης τις απαραίτητες πληροφορίες και διαπιστευτήρια.
es: Para obtener acceso autenticado a los servicios de OpenStack, primero debe realizar una solicitud de autenticación al servicio Identity de OpenStack con el fin de obtener un token de autenticación. Para solicitar el token de autenticación debe facilitar las credenciales en la solicitud.
it: Per autenticare l'accesso ai servizi di OpenStack, è necessario prima emettere una richiesta di autenticazione per OpenStack Identity per acquisire un biglietto di autenticazione. Per richiedere un biglietto di autenticazione, è necessario fornire un carico utile di credenziali nella richiesta di autenticazione.
ja: OpenStack サービスへのアクセスを認証するために、まず認証トークンを取得するために、OpenStack Identity に認証リクエストを発行する必要があります。認証トークンをリクエストするために、認証リクエストにクレデンシャルのペイロードを指定する必要があります。
ko_kr: OpenStack 서비스에 접근 인증을 하기 위해선, 먼저 인증 토큰을 사용하여 OpenStack Identity에서 인증을 요청해야 합니다. 인증 토큰을 요청을 위해 credential의 payload를 제공합니다.

source: To begin sending API requests, use one of the following methods:
de: Um mit dem Senden von API Anfragen zu beginnen, benutzen Sie eine der folgenden Methoden:
el: Για να ξεκινήσετε να στέλνετε αιτήσεις API, χρησιμοποιήστε μια από τις παρακάτω μεθόδους:
es: Para comenzar a enviar peticiones al API utilice uno de los siguientes métodos:
it: Per iniziare a inviare richieste API, utilizzare uno dei seguenti metodi:
ja: API リクエストの送信を始めるために、以下の方法のどれかを使用します。
ko_kr: API 요청을 보내기 위해, 다음 방법의 하나를 선택해 사용합니다:

source: To launch an instance named <literal>my_instance</literal>, run the <placeholder-1/> command with the image and flavor IDs and the server name, as follows:
de: Um eine Instanz mit dem Namen <literal>my_instance</literal> zu starten, führen Sie den <placeholder-1/> Befehl mit den IDs des Abbildes und der Variante sowie dem Namen des Servers wie folgt aus:
el: Για να γίνει έναρξη μιας εικονικής μηχανής με το όνομα <literal>my_instance</literal>, εκτελέστε την εντολή <placeholder-1/> με το image και τις Ταυτότητες των εικονικών προτύπων υλικού και το όνομα του διακομιστή, όπως ακολουθεί:
es: Para lanzar una instancia con el nombre <literal>my_instance</literal> ejecute el comando <placeholder-1/> con los identificadores de la imagen y el sabor y el nombre del servidor, de la siguiente forma:
it: Per avviare un'istanza denominata <literal>my_instance</literal>, eseguire il <placeholder-1/> comando con l'immagine e sapore ID e il nome del server, come segue:
ja: <literal>my_instance</literal> という名前のインスタンスを起動するために、以下のようにイメージ ID、フレーバー ID、サーバー名を用いて <placeholder-1/> コマンドを実行します。
ko_kr: <literal>my_instance</literal>라는 이름을 가진 인스턴스를 시작합니다. 이미지, flavor ID, 서버 이름을 입력하여 <placeholder-1/> 명령을 다음과 같이 실행합니다:

source: To launch an instance, note the IDs of your desired image and flavor.
de: Um eine Instanz zu starten, notieren Sie sich die IDs des gewünschten Abbildes und der Variante.
el: Για να γίνει έναρξη μιας εικονικής μηχανής, σημειώστε τις Ταυτότητες των επιθυμητών σας images και εικονικών προτύπων υλικού.
es: Para iniciar una instancia, tenga en cuenta los ID de la imagen y sabor que desea para la instancia.
it: Per avviare un'istanza, nota gli ID della tua immagine desiderata e sapore.
ja: インスタンスを起動するために、使用したいイメージとフレーバーの ID を記録します。
ko_kr: 인스턴스를 시작하기 전, 원하는 이미지와 flavor의 ID를 확인합니다.

source: To launch instances, you must choose a name, an image, and a flavor for your instance.
de: Um eine Instanz zu starten müssen Sie einen Namen, ein Abbild und eine Variante für Ihre Instanz auswählen.
el: Για να κάνετε έναρξη εικονικών μηχανών, πρέπει να επιλέξετε ένα όνομα, ένα image και ένα εικονικό πρότυπο υλικού για την εικονική σας μηχανή.
es: Para lanzar instancias debe elegir un nombre, una imagen y un sabor para la instancia.
it: Per lanciare istanze, è necessario scegliere un nome, un'immagine e un gusto per l'istanza.
ja: インスタンスを起動する場合、インスタンスの名前、イメージ、フレーバーを選択する必要があります。
ko_kr: 인스턴스를 시작하기 위해 이름, 이미지, 인스턴스의 flavor를 선택해야 합니다.

source: To list available images, call the Compute API through the <placeholder-1/> client, as follows:
de: Um eine Liste der verfügbaren Abbilder anzuzeigen, rufen Sie die Compute API durch den <placeholder-1/> Client wie folgt auf:
el: Για να γίνει λίστα των διαθέσιμων images, καλέστε το Υπολογιστικό API μέσω του λογισμικού <placeholder-1/>, όπως ακολουθεί:
es: Para obtener un listado con las imágenes disponibles, invoque el API Compute a través del cliente <placeholder-1/>, de la siguiente forma:
it: Per elencare immagini disponibili, chiamare l'API Compute attraverso l' <placeholder-1/> cliente, come segue:
ja: 利用可能なイメージを一覧表示するために、以下のように <placeholder-1/> クライアントから Compute API を呼び出します。
ko_kr: 다음과 같은 사용할 수 있는 이미지 목록을 보려면, <placeholder-1/> 클라이언트에서 Compute API를 호출해야 합니다:

source: To list flavors, run this command:
de: Führen Sie folgendes Kommando aus um eine Liste der Varianten anzuzeigen:
el: Για να γίνει λίστα εικονικών προτύπων υλικού, εκτελέστε αυτή την εντολή:
es: Para obtener un listado de los sabores, ejecute este comando:
it: Per elencare i sapori, eseguire questo comando:
ja: フレーバーを一覧表示するために、このコマンドを実行します。
ko_kr: Flavor 목록을 확인하려면, 다음 명령을 실행하십시오:

source: To remove the <placeholder-1/> client, run this command:
de: Um den <placeholder-1/> Client zu entfernen, führen Sie dieses Kommando aus:
el: Για να αφαιρέσετε το λογισμικό <placeholder-1/>, εκτελέστε αυτή την εντολή:
es: Para desinstalar el cliente <placeholder-1/>, ejecute este comando:
it: Per rimuovere il <placeholder-1/> cliente, eseguire questo comando:
ja: <placeholder-1/> クライアントを削除する場合、このコマンドを実行します。
ko_kr: <placeholder-1/> 클라이언트를 삭제하기 위해선, 다음 명령을 실행합니다:

source: To update the <placeholder-1/> client, run this command:
de: Um den <placeholder-1/> Client zu aktualisieren, führen Sie dieses Kommando aus:
el: Για να αναβαθμίσετε το λογισμικό <placeholder-1/>, εκτελέστε αυτή την εντολή:
es: Para instalar el cliente <placeholder-1/>, ejecute este comando:
it: Per aggiornare il <placeholder-1/> cliente, eseguire questo comando:
ja: <placeholder-1/> クライアントを更新する場合、このコマンドを実行します。
ko_kr: <placeholder-1/> 클라이언트를 업데이트하기 위해선, 다음 명령을 실행합니다:

source: To view details for a specified server, use the <placeholder-1/> command. Include the ID of the server:
de: Um Details eines bestimmten Servers einzusehen, benutzen Sie das <placeholder-1/> Kommando. Berücksichtigen Sie die ID des Servers:
el: Για να δείτε λεπτομέρειες για έναν συγκεκριμένο διακομιστή, χρησιμοποιήστε την <placeholder-1/> εντολή. Συμπεριλάβετε την Ταυτότητα του διακομιστή:
es: Para obtener detalles de un servidor específico use el comando <placeholder-1/> . Incluya el ID del servidor:
it: Per visualizzare i dettagli di un server specifico, utilizzare il comando <placeholder-1/> . Includere l'ID del server:
ja: 指定したサーバーの詳細を表示するために、<placeholder-1/> コマンドを使用します。サーバー ID を含めます。
ko_kr: 특정 서버에 대한 자세한 설명을 보기 위해, <placeholder-1/> 명령을 사용합니다. 서버의 ID를 입력하세요:

source: Type
de: Typ
el: Τύπος
es: Tipo
it: Tipo
ja: 形式
ko_kr: 타입

source: Use <placeholder-1/> to install the OpenStack clients on a Mac OS X or Linux system. It is easy and ensures that you get the latest version of the client from the <link xlink:href="http://pypi.python.org/pypi">Python Package Index</link>. Also, <placeholder-2/> lets you update or remove a package.
el: Χρησιμοποιήστε το <placeholder-1/> για να εγκαταστήσετε τα λογισμικά του OpenStack σε σύστημα Mac OS ή Linux. Είναι εύκολο και εξασφαλίζει ότι θα λάβετε την τελευταία έκδοση του λογισμικού από το <link xlink:href="http://pypi.python.org/pypi">Python Package Index</link>. Επίσης, το <placeholder-2/> σας επιτρέπει να ενημερώσετε ή να αφαιρέσετε ένα λογισμικό.

source: Use the <placeholder-1/> command to view your server:
de: Benutzen Sie das <placeholder-1/> Kommando, um den Server zu sehen:
el: Χρησιμοποιήστε την εντολή <placeholder-1/> για να δείτε το διακομιστή σας:
es: Utilice el comando <placeholder-1/> para ver su servidor:
it: Utilizzare il comando <placeholder-1/> per visualizzare il server:
ja: お使いのサーバーを表示するために、<placeholder-1/> コマンドを使用します。
ko_kr: <placeholder-1/> 명령을 사용하여 서버를 확인할 수 있습니다:

source: Use the Compute API to list flavors, as follows:
el: Χρησιμοποιήστε το Υπολογιστικό API για να γίνει λίστα εικονικών προτύπων υλικού, όπως ακολουθεί:

source: Use the Compute API to list images, as follows:
el: Χρησιμοποιήστε το Υπολογιστικό ΑPI για να γίνει λίστα images όπως ακολουθεί:

source: Use the Compute API to list servers, as follows:
de: Verwenden Sie die Compute API zum List-Server wie folgt:
el: Χρησιμοποιήστε το Υπολογιστικό ΑPI για να γίνει λίστα διακομιστών, όπως ακολουθεί:
es: Utilice el API de Compute para listar los servidores, de la siguiente forma:
it: Utilizzare Compute API per elencare i server, come segue:
ja: サーバーを一覧表示するために、以下のように Compute API を使用します。
ko_kr: Compute API를 사용하여 서버 목록을 보고 싶으면, 다음과 같이합니다:

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See <link xlink:href="http://docs.openstack.org/user-guide/sdk.html">OpenStack Python SDK</link> in the <citetitle>OpenStack End User Guide</citetitle>.
el: Χρησιμοποίησε αυτό το SDK για να φτιάξετε δέσμες ενεργειών αυτοματισμού Python που δημιουργούν και διαχειρίζονται πόρους στο OpenStack cloud σας. Το SDK εφαρμόζει bindings του Python στο API OpenStack, που σας δινει τη δυνατότητα να χειρίζεστε εργασίες αυτοματοποίησης στο Python εκτελώντας προγράμματά Python αντί να εκτελείτε τo REST απευθείας. Όλα τα εργαλεία γραμμής εντολών OpenStack διεξάγονται με τη χρήση του Python SDK. Δείτε <link xlink:href="http://docs.openstack.org/user-guide/sdk.html">OpenStack Python SDK</link> στο <citetitle> Εγχειρίδιο Τελικού Χρήστη</citetitle>.

source: When you send API requests, you include the token in the <literal>X-Auth-Token</literal> header. If you access multiple OpenStack services, you must get a token for each service. A token is valid for a limited time before it expires. A token can also become invalid for other reasons. For example, if the roles for a user change, existing tokens for that user are invalid.
de: Wenn Sie eine API Anfrage senden, beinhaltet diese den Token im <literal>X-Auth-Token</literal> header. Wenn Sie auf mehrere OpenStack Dienste zugreifen müssen Sie einen Token für jeden Dienst haben. Ein Token ist nur für eine begrenzte Zeit gültig bis dieser abläuft. Ein Token kann auch aus anderen Gründen ungültig werden. Zum Beispiel werden vorhandene Token eines Benutzers ungültig, wenn sich die Rollen des Benutzers verändern.
el: Όταν στέλνετε αιτήσεις API, να εμπερικλείεται ο κωδικός επαλήθευσης ταυτότητας στην κεφαλίδα <literal>X-Auth-Token</literal>. Αν έχετε πρόσβαση σε πολλαπλές OpenStack υπηρεσίες, πρέπει να πάρετε κωδικό επαλήθευσης ταυτότητας για κάθε υπηρεσία. Ο κωδικός επαλήθευσης είναι έγκυρος για περιορισμένο χρόνο προτού λήξει. Ο κωδικός επαλήθευσης ταυτότητας μπορεί επίσης να ακυρωθεί για άλλους λόγους. Για παράδειγμα, αν οι ρόλοι ενός χρήστη αλλάξουν, οι υπάρχοντες κωδικοί επαλήθευσης ταυτότητας για αυτόν τον χρήστη είναι άκυροι.
es: Cuando envía peticiones al API incluye en la cabecera el token <literal>X-Auth-Token</literal>. Si accede a varios servicios de OpenStack debe obtener un token para cada servicio. El token tiene una duración limitada, pasado ese tiempo caduca. Un token también puede invalidarse pro otros motivos. Por ejemplo: si un usuario cambia de rol los tokens que tuviese dicho usuario se invalidan.
it: Quando si inviano richieste API, si include il biglietto nell'intestazione <literal>X-Auth-Token</literal>. Se si accede a più servizi OpenStack, è necessario ottenere un biglietto per ogni servizio. Un biglietto è valido per un periodo di tempo limitato prima della scadenza. Un biglietto può anche diventare non valido per altri motivi. Ad esempio, se i ruoli per cambiare utente, i biglietti esistenti per l'utente non sono validi.
ja: API リクエストの送信時、<literal>X-Auth-Token</literal> ヘッダーにトークンを含めます。複数の OpenStack サービスにアクセスする場合、各サービス用のトークンを取得する必要があります。トークンは一定時間有効で、その後期限切れします。トークンは別の理由により失効することもあります。例えば、ユーザーのロールが変更された場合、そのユーザーの既存のトークンは無効になります。
ko_kr: API 요청을 보낼때, <literal>X-Auth-Token</literal> 헤더에 토큰이 포함되어있습니다. 여러 OpenStack 서비스에 접근할때, 각 서비스에서 토큰을 받아야합니다. 토큰은 제한된 시간동안만 유효합니다. 토큰이 다른 이유로 무효가 될 수 있습니다. 예를 들어, 사용자가에 대한 롤이 변경되었다면, 해당 사용자에 대한 토큰이 변경되었을 수 있습니다.

source: Where <replaceable>PROJECT</replaceable> is the project name.
de: <replaceable>PROJEKT</replaceable> ist der Projektname.
el: Όπου <replaceable>PROJECT</replaceable> είναι το όνομα της οργανωτικής μονάδας.
es: Dónde <replaceable>PROJECT</replaceable> es el nombre del proyecto.
it: Dove <replaceable>PROJECT</replaceable> è il nome del progetto.
ja: <replaceable>PROJECT</replaceable> はプロジェクト名です。
ko_kr: 여기서 <replaceable>PROJECT</replaceable>는 프로젝트 이름입니다.

source: You must install each client separately.
de: Sie müssen jeden Client einzeln installieren.
el: Πρέπει να εγκαταστήσετε κάθε λογισμικό ξεχωριστά.
es: Debe instalar cada cliente por separado.
it: È necessario installare separatamente ciascun cliente.
ja: 各クライアントをそれぞれインストールする必要があります。
ko_kr: 개별적으로 클라이언트들을 설치합니다.

source: password (required)
el: κωδικός πρόσβασης (υποχρεωτικός)

source: tenantId
el: ΤαυτότηταΟργανωτικήςΜονάδαςτουCloud
es: id del proyecto

source: tenantId (Optional)
el: ΤαυτότηταΟργανωτικήςΜονάδαςτουCloud (Προαιρετικό)
es: Identificador el proyecto (Opcional)
it: tenantId (Opzionale)
ja: tenantId (オプション)
ko_kr: tenantId (옵션)

source: tenantName
el: 'ΟνομαΟργανωτικήςΜονάδαςτουCloud
es: Nombre del proyecto

source: tenantName (Optional)
el: 'ΟνομαΟργανωτικήςΜονάδαςτουCloud. (Προαιρετικό)
es: nombre del proyecto (Opcional)
it: tenantName (Opzionale)
ja: tenantName (オプション)
ko_kr: tenantName (옵션)

source: tenant_id
el: ταυτότητα_οργανωτικών μονάδων

source: token
el: κωδικός επαλήθευσης ταυτότητας
it: biglietto
ja: トークン

source: token (Optional)
el: κωδικός επαλήθευσης ταυτότητας (Προαιρετικό)
es: token de autenticación (Opcional)
it: biglietto (Opzionale)
ja: token (オプション)
ko_kr: token (옵션)

source: translator-credits
de: Danksagungen an die Übersetzer
el: μεταφραστής/τρια-μονάδες
it: Crediti di traduzione
ja: ktanaka <kj.tanaka@gmail.com>, 2013 Tomoyuki KATO <tomo@dream.daynight.jp>, 2012-2014
ko_kr: Sungjin Gang <ujuc@ujuc.kr>, 2012-2014. Yeonki Choi < >, 2013. Jay Lee <hyangii@gmail.com>, 2013

source: username (required)
el: όνομα χρήστη (υποχρεωτικό)

source: For information about the command-line clients, see <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
de: Für Informationen über die Kommandozeilen-Clients, siehe <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Kommandozeilenschnitstelle Referenz</citetitle></link>.
es: Para ampliar información sobre los clientes de línea de comando consulte: <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
it: Per informazioni sui clienti a riga di comando, vedere <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>.
ja: コマンドラインクライアントに関する情報は <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link> を参照してください。
ko_kr: 명령 줄 클라이언트에 대한 자세한 설명은 <link href="http://docs.openstack.org/cli-reference/content/"><citetitle>OpenStack Command-Line Interface Reference</citetitle></link>에서 확인할 수 있습니다.

source: Use <placeholder-1/> to install the OpenStack clients on a Mac OS X or Linux system. It is easy and ensures that you get the latest version of the client from the <link href="http://pypi.python.org/pypi">Python Package Index</link>. Also, <placeholder-2/> lets you update or remove a package.
de: Benutzen Sie <placeholder-1/> um den OpenStack Client auf Mac OS X oder einem Linux System zu installieren. Es ist einfach und stellt sicher, dass Sie die aktuellste Version des Clients von dem <link href="http://pypi.python.org/pypi">Python Package Index</link> bekommen. Außerdem lässt Sie <placeholder-2/> Pakete aktualisieren oder entfernen.
es: Para instalar los clientes OpenStack en un sistema Mac OS X o Linux utilice: <placeholder-1/>. Es sencillo de utilizar y garantiza que obtendremos la última versión disponible del cliente desde <link href="http://pypi.python.org/pypi">Python Package Index</link>. También <placeholder-2/> nos permite actualizar o eliminar los clientes de OpenStack.
it: Utilzzare <placeholder-1/> per installare i clienti OpenStack su sistemi Mac OS X o Linux. É facile e assicura che si ottenga l'ultima versione de cliente dal <link href="http://pypi.python.org/pypi">Python Package Index</link>. Inoltre <placeholder-2/> consente di aggiornare o rimuovere un pacchetto.
ja: Mac OS X や Linux のシステムに OpenStack クライアントをインストールするために、<placeholder-1/> を使用します。<link href="http://pypi.python.org/pypi">Python Package Index</link> からクライアントの最新バージョンを簡単かつ確実に取得できます。また、<placeholder-2/> により、パッケージを更新したり削除したりできます。
ko_kr: Mac OS X이나 Linux 시스템에서 <placeholder-1/>를 사용하여 OpenStack 클라이언트를 설치합니다. <link href="http://pypi.python.org/pypi">Python Package Index</link>를 사용하여 클라이언트의 최신 버전으로 쉽게 설치가 됩니다. 또한, <placeholder-2/>를 이용하여 패키지를 업데이트하거나, 삭제할 수 있습니다.
