Repository: openstack/api-site
Catalog: api-ref-guides/locale/*.po
Languages: de, it, ja

source: Preface
de: Vorwort
it: Prefazione
ja: はじめに

source: Use the OpenStack APIs and extensions in your OpenStack cloud.
de: Verwenden Sie OpenStack APIs und Erweiterungen in Ihrer OpenStack Cloud.
it: Usa le API di OpenStack e l'estensioni nel tuo Cloud OpenStack.
ja: お使いの OpenStack クラウドで OpenStack API および拡張を使用します。

source: You must install the packages for each API separately. After you authenticate through the <link href="api-ref-identity.html">Identity API</link>, you can use the other APIs and extensions to launch server instances, create images, assign metadata to instances and images, create containers and objects, and complete other actions in your OpenStack cloud. To get started with the APIs, see the <link href="http://docs.openstack.org/api/quick-start/content/">OpenStack API Quick Start</link>.
de: Sie müssen die Pakete für jedes API einzeln installieren. Nachdem Sie sich durch <link href="api-ref-identity.html">Identity API</link> authentifiziert haben können Sie die anderen APIs und Erweiterungen verwenden um Server-Instanzen zu starten, Abbilder zu erzeugen, Metadaten zu Instanzen und Abbildern hinzuzufügen, Container und Objekte zu erzeugen und andere Aktionen in Ihrer OpenStack Cloud durchzuführen. Um mit den APIs zu beginnen, lesen Sie <link href="http://docs.openstack.org/api/quick-start/content/">OpenStack API Quick Start</link>.
it: È necessario installare i pacchetti per ogni API separatamente. Dopo l'autenticazione attraverso il <link href="api-ref-identity.html"> Identity API </ link>, è possibile utilizzare le altre API ed estensioni per lanciare istanze del server, creare immagini, assegnare metadati alle istanze e immagini, creare contenitori e oggetti e completare altre azioni nel cloud OpenStack. Per iniziare con le API, vedere la <link href="http://docs.openstack.org/api/quick-start/content/"> OpenStack API Quick Start </ link>.
ja: 各 API のパッケージをそれぞれインストールする必要があります。お使いの OpenStack クラウドで、<link href="api-ref-identity.html">Identity API</link> 経由で認証後、サーバーインスタンスを起動する、インスタンスにメタデータを割り当てる、コンテナーやオブジェクトを作成する、完全に別の操作をするために、他の API および拡張を使用できます。API を始めるために、<link href="http://docs.openstack.org/api/quick-start/content/">OpenStack API Quick Start</link> を参照してください。

source: OpenStack Block Storage API v1 Reference
de: OpenStack Block-Speicher API v1 Referenz
it: OpenStack Block Storage API v1 Referenza
ja: OpenStack Block Storage API v1 リファレンス

source: API Reference
de: API Referenz
it: Riferimento API
ja: API リファレンス

source: OpenStack Block Storage
de: OpenStack Block-Speicher

source: Copyright details are filled in by the template.
de: Copyright Informationen werden durch die Vorlage ausgefüllt.
it: Copyright dettagli riempiti nel modello.

source: OpenStack Compute API v3 Reference (EXPERIMENTAL)
de: OpenStack Compute API v3 Referenz (EXPERIMENTELL)
ja: OpenStack Compute API v3 リファレンス (EXPERIMENTAL)

source: API Reference (EXPERIMENTAL)
de: API Referenz (EXPERIMENTELL)
ja: API リファレンス (EXPERIMENTAL)

source: OpenStack Compute API v2 Extensions Reference
de: OpenStack Compute API v2 Erweiterungsreferenz
it: OpenStack Compute API v2 Estensioni di Riferimento
ja: OpenStack Compute API v2 拡張リファレンス

source: OpenStack API Complete Reference
de: OpenStack API Vollständige Referenz
it: OpenStack API Completa Referenza
ja: OpenStack API Complete リファレンス

source: API Complete Reference
de: API Komplettreferenz
it: API Completa Referenza
ja: API Complete リファレンス

source: OpenStack Networking (neutron) API v2.0 and Extensions Reference
de: OpenStack Netzwerk (neutron) API v2.0 und Erweiterungs-Referenz
it: OpenStack Networking (neutron) API v2.0 e l'Estensioni di Referenza
ja: OpenStack Networking (neutron) API v2.0 および拡張リファレンス

source: Networking (neutron) API Reference
de: Netzwerk (neutron) API Referenz
it: Networking (neutron) API Referenza
ja: Networking (neutron) API リファレンス

source: OpenStack Networking (neutron)
de: OpenStack Netzwerk (neutron)

source: OpenStack Orchestration API v1 Reference
de: OpenStack Orchestrierungs-API v1 Referenz
it: OpenStack Orchestration API v1 Referenza
ja: OpenStack Orchestration API v1 リファレンス

source: Orchestration API Reference
de: Orchestrierungs-API Referenz
ja: Orchestration API リファレンス

source: OpenStack Orchestration
de: OpenStack Orchestrierung

source: OpenStack Compute API v2 Reference
de: OpenStack Compute API v2 Referenz
it: OpenStack Compute API v2 Referenza
ja: OpenStack Compute API v2 リファレンス

source: OpenStack Identity API v3 Reference
de: OpenStack Identitäts-API v3 Referenz
it: OpenStack Identity API v3 Referenza
ja: OpenStack Identity API v3 リファレンス

source: Identity API Reference
de: Identitäts-API Referenz
it: identità API Referenza
ja: Identity API リファレンス

source: OpenStack Identity
de: OpenStack Identität
it: Identià OpenStack

source: OpenStack Image Service API v2 Reference
de: OpenStack Abbild-Dienst API v2 Referenz
it: OpenStack Image Service API v2 Referenza
ja: OpenStack Image Service API v2 リファレンス

source: OpenStack Image Service
de: OpenStack Abbild-Dienst

source: OpenStack Image Service API v1 Reference
de: OpenStack Abbild-Dienst API v1 Referenz
it: OpenStack Image Service API v1 Referenza
ja: OpenStack Image Service API v1 リファレンス

source: OpenStack Telemetry API v2 Reference
de: OpenStack Telemetrie API v2 Referenz
it: OpenStack Telemetry API v2 Referenza
ja: OpenStack Telemetry API v2 リファレンス

source: Telemetry API Reference
de: Telemetrie API Referenz
it: Telemetria di Riferimento API
ja: Telemetry API リファレンス

source: OpenStack Telemetry
de: OpenStack Telemetrie
it: OpenStack Telemetria

source: OpenStack Database Service API v1.0
de: OpenStack Datanbank-Dienst API v1.0

source: OpenStack Identity API v2.0 Reference
de: OpenStack Identitäts-API v2.0 Referenz
it: OpenStack Identity API v2.0 Referenza
ja: OpenStack Identity API v2.0 リファレンス

source: OpenStack Block Storage API v2 Reference
de: OpenStack Block-Speicher API v2 Referenz
it: OpenStack Block Storage API v2 Referenza
ja: OpenStack Block Storage API v2 リファレンス

source: OpenStack Object Storage API v1 Reference
de: OpenStack Objektspeicher API v1 Referenz
it: OpenStack Object Storage API v1 Referenza
ja: OpenStack Object Storage API v1 リファレンス

source: OpenStack Object Storage
de: OpenStack Objektspeicher

source: translator-credits
de: Danksagungen an die Übersetzer
it: Crediti di traduzione
ja: Tomoyuki KATO <tomo@dream.daynight.jp>, 2014
